{
  "acer_pseudoplatanus": [
    "Acer pseudoplatanus, known as the sycamore in the United Kingdom and the sycamore maple in the United States, is a flowering plant species in the soapberry and lychee family Sapindaceae. It is a large deciduous, broad-leaved tree, tolerant of wind and coastal exposure. It is native to Central Europe and Western Asia, from France eastward to Ukraine, northern Turkey and the Caucasus and southward in the mountains of northern Spain and Italy."
  ],
  "fraxinus_ornus": [
    "Fraxinus ornus, the manna ash or South European flowering ash, is a species of Fraxinus native to southern Europe and southwestern Asia, from Spain and Italy north to Austria and the Czech Republic, and east through the Balkans, Turkey, and western Syria to Lebanon and Armenia."
  ],
  "acer_macrophyllum": [
    "Acer macrophyllum, the bigleaf maple or Oregon maple, is a large deciduous tree in the genus Acer."
  ],
  "prunus_cerasifera": [
    "Prunus cerasifera is a species of plum known by the common names cherry plum and myrobalan plum. It is native to Southeast Europe and Western Asia, and is naturalised in the British Isles and scattered locations in North America. Also naturalized in parts of SE Australia where it is considered to be a mildly invasive weed of bushland near urban centers."
  ],
  "liriodendron_tulipifera": [
    "Liriodendron tulipifera—known as the tulip tree, American tulip tree, tulipwood, tuliptree, tulip poplar, whitewood, fiddletree, and yellow-poplar—is the North American representative of the two-species genus Liriodendron, and the tallest eastern hardwood. It is native to eastern North America from Southern Ontario and possibly southern Quebec to Illinois eastward to southwestern Massachusetts and Rhode Island, and south to central Florida and Louisiana. It can grow to more than 50 m (160 ft) in virgin cove forests of the Appalachian Mountains, often with no limbs until it reaches 25–30 m (80–100 ft) in height, making it a very valuable timber tree."
  ],
  "parrotia_persica": [
    "Parrotia persica, the Persian ironwood, is a deciduous tree in the family Hamamelidaceae, closely related to the witch-hazel genus Hamamelis. It is native to Iran's Caspian region and Iranian Azerbaijan. It is endemic in the Alborz mountains, where it is found mainly in Golestan National Park."
  ],
  "acer_platanoides": [
    "Acer platanoides, commonly known as the Norway maple, is a species of maple native to eastern and central Europe and western Asia, from France east to Russia, north to southern Scandinavia and southeast to northern Iran. It was brought to North America in the mid-1700s as a shade tree. It is a member of the family Sapindaceae."
  ],
  "gleditsia_triacanthos": [
    "The honey locust, also known as the thorny locust or thorny honeylocust, is a deciduous tree in the family Fabaceae, native to central North America where it is mostly found in the moist soil of river valleys. Honey locust is highly adaptable to different environments, has been introduced worldwide, and is an aggressive invasive species."
  ],
  "acer_rubrum": [
    "Acer rubrum, the red maple, also known as swamp, water or soft maple, is one of the most common and widespread deciduous trees of eastern and central North America. The U.S. Forest service recognizes it as the most abundant native tree in eastern North America. The red maple ranges from southeastern Manitoba around the Lake of the Woods on the border with Ontario and Minnesota, east to Newfoundland, south to Florida, and southwest to East Texas. Many of its features, especially its leaves, are quite variable in form. At maturity, it often attains a height of around 30 m (100 ft). Its flowers, petioles, twigs and seeds are all red to varying degrees. Among these features, however, it is best known for its brilliant deep scarlet foliage in autumn."
  ],
  "prunus_serrulata": [
    "Prunus serrulata or Japanese cherry is a species of cherry tree that grows naturally in Japan, China, Korea and Russia, and it also refers to a cultivar produced from Prunus speciosa , a cherry tree endemic in Japan. Historically, the Japanese have developed many cultivars by selective breeding of cherry trees, which are produced by the complicated crossing of several wild species, and they are used for ornamental purposes all over the world. Of these, the cultivars produced by complex interspecific hybrids based on the Oshima cherry are also known as the Cerasus Sato-zakura Group."
  ],
  "ulmus_americana": [
    "Ulmus americana, generally known as the American elm or, less commonly, as the white elm or water elm, is a species of elm native to eastern North America, naturally occurring from Nova Scotia west to Alberta and Montana, and south to Florida and central Texas. The American elm is an extremely hardy tree that can withstand winter temperatures as low as −42 °C. Trees in areas unaffected by Dutch elm disease (DED) can live for several hundred years. A prime example of the species was the Sauble Elm, which grew beside the banks of the Sauble River in Ontario, Canada, to a height of 43 m (140 ft), with a diameter at breast hieght of 196 cm (6.43 ft) before succumbing to DED; when it was felled in 1968, a tree-ring count established that it had germinated in 1701."
  ],
  "ulmus_pumila": [
    "Ulmus pumila, the Siberian elm, is a tree native to Central Asia, eastern Siberia, the Russian Far East, Mongolia, Tibet, northern China, India and Korea. It is also known as the Asiatic elm and dwarf elm, but sometimes miscalled the 'Chinese Elm'. It is the last tree species encountered in the semi-desert regions of central Asia. Described by Pallas in the 18th century from specimens from Transbaikal, Ulmus pumila has been widely cultivated throughout Asia, North America, Argentina, and southern Europe, becoming naturalized in many places, notably across much of the United States."
  ],
  "prunus_x_yedoensis": [
    "Prunus × yedoensis is a hybrid cherry between Prunus speciosa Prunus pendula f. ascendens. It was created in Japan and one of its cultivars, Prunus × yedoensis 'Somei-yoshino' or Yoshino cherry, is one of the most popular and widely planted cherry cultivar in temperate regions today. 'Somei-yoshino' is a clone from a single tree, and all Somei-yoshino cultivars are propagated by grafting. It inherits Edohigans characteristic that flowers bloom before the leaves unfold and that it grow to between 30-40' tall. It also inherits the characteristics of the Oshima zakura, which grows rapidly and has white flowers."
  ],
  "carpinus_betulus": [
    "Carpinus betulus, the European or common hornbeam, is a species of tree in the birch family Betulaceae, native to Western Asia and central, eastern, and southern Europe, including southern England. It requires a warm climate for good growth, and occurs only at elevations up to 1,000 metres (3,281 ft). It grows in mixed stands with oak, and in some areas beech, and is also a common tree in scree forests. Hornbeam was also known as 'Yoke Elm'."
  ],
  "thuja_plicata": [
    "Thuja plicata, commonly called western red cedar or Pacific red cedar, giant arborvitae or western arborvitae, or just cedar, giant cedar, or shinglewood, is a species of Thuja, an evergreen coniferous tree in the cypress family Cupressaceae, native to western North America. It is not a true cedar of the genus Cedrus."
  ],
  "acer_x_freemani": [
    "Acer × freemanii, commonly called Freeman maple, is a hybrid of red and silver maples taking the best qualities of both trees including solid structure and form and fantastic fall color.  It prefers well-drained moist, acidic soil in the full sun to partial shade.  It makes an excellent shade, lawn, or street tree that can tolerate heavy clay soils and even occasionally wet soils. Once trees are established they can tolerate some drought."
  ],
  "malus_pumila": [
    "An apple is an edible fruit produced by an apple tree. Apple trees are cultivated worldwide and are the most widely grown species in the genus Malus. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today. Apples have been grown for thousands of years in Asia and Europe and were brought to North America by European colonists. Apples have religious and mythological significance in many cultures, including Norse, Greek, and European Christian tradition."
  ],
  "acer_campestre": [
    "Acer campestre, known as the field maple, is a flowering plant species in the family Sapindaceae. It is native to much of continental Europe, Britain, southwest Asia from Turkey to the Caucasus, and north Africa in the Atlas Mountains. It has been widely planted, and is introduced outside its native range in Europe and areas of USA and Western Australia with suitable climate."
  ],
  "pinus_nigra": [
    "Pinus nigra, the Austrian pine or black pine, is a moderately variable species of pine, occurring across southern Mediterranean Europe from the Iberian Peninsula to the eastern Mediterranean, on the Anatolian peninsula of Turkey, on Corsica and Cyprus, as well as Crimea and in the high mountains of Northwest Africa."
  ],
  "malus_zumi": [
    "Malus is a genus of about 35 species of deciduous trees and shrubs from Europe, Asia and North America. Malus hybrids are deciduous shrubs or trees that grow up to 26'. They can be very showy for a short period in spring. Some cultivars have ornamental fruit. Its form is usually round to spreading crown and can be vase-shaped; however, the form varies with spp. and cultivar. Malus hybrids tolerate a range of soil types but prefers slightly acidic, moist well-drained soil in full sun. Plant as a specimen, in groupings, along borders, or in parks.  This tree is frequently damaged by deer and has disease and insect problems. This plant blooms early to mid-spring and is usually self-sterile. Buds are a darker shade than blooms. Tree appears to change color as it cycles through stages of new (reddish) growth, full (pink to white) growth, mature leaves (green), and autumnal color (red-varies). Small fruits ripen in the fall. "
  ],
  "cedrus_atlantica": [
    "Cedrus atlantica, the Atlas cedar, is a species of tree in the pine family Pinaceae, native to the Atlas Mountains of Morocco, to the Rif, and to the Tell Atlas in Algeria. A majority of the modern sources treat it as a distinct species Cedrus atlantica, but some sources consider it a subspecies of Lebanon cedar."
  ],
  "corylus_americana": [
    "Corylus americana, the American hazelnut or American hazel, is a species of deciduous shrub in the genus Corylus, native to the eastern and central United States and extreme southern parts of eastern and central Canada."
  ],
  "salix_babylonica": [
    "Salix babylonica is a species of willow native to dry areas of northern China, but cultivated for millennia elsewhere in Asia, being traded along the Silk Road to southwest Asia and Europe."
  ],
  "crataegus_oxyacantha": [
    "The name Crataegus oxyacantha L. has been rejected as being of uncertain application, but is sometimes still used."
  ],
  "malus_floribunda": [
    "Malus floribunda, common name Japanese flowering crabapple, Japanese crab, purple chokeberry, or showy crabapple, originates from Japan and East Asia. It may be a hybrid of M. sieboldii with M. baccata, in which case it would be written as Malus × floribunda."
  ],
  "cornus_kousa": [
    "Cornus kousa is a small deciduous tree 8–12 m (26–39 ft) tall, in the flowering plant family Cornaceae. Common names include kousa, kousa dogwood, Chinese dogwood, Korean dogwood, and Japanese dogwood. Synonyms are Benthamia kousa and Cynoxylon kousa. It is a plant native to East Asia including Korea, China and Japan. Widely cultivated as an ornamental, it is naturalized in New York State."
  ],
  "styrax_japonica": [
    "Styrax japonicus is a deciduous flowering tree with a relatively compact habit  that can be vase-shaped when young but with low horizontal branching and a more broadly rounded crown with age.  It prefers moist, acidic well-drained soil in the full sun to partial shade.  casts light shade. This tree is moderately salt tolerant. Blooms in late spring and fruit ripens in late summer; foliage occurs on upper portion of branches and does not obscure pendulous flowers significantly; bark has irregular, interlacing orange-brown fissures which adds interest to a winter landscape; excellent for hillside or slope planting, but needs consistent moisture.  Plant near a patio, in a lawn, a border or in small groupings.  Plant it alongside a building on the northern side to protect it from strong winds and to provide a lovely dappled shade for underplantings.  It does not tolerate heat or drought very well."
  ],
  "betula_pendula": [
    "Betula pendula, commonly known as silver birch, warty birch, European white birch, or East Asian white birch, is a species of tree in the family Betulaceae, native to Europe and parts of Asia, though in southern Europe, it is only found at higher altitudes. Its range extends into Siberia, China, and southwest Asia in the mountains of northern Turkey, the Caucasus, and northern Iran. It has been introduced into North America, where it is known as the European white birch, and is considered invasive in some states in the United States and parts of Canada. The tree can also be found in more temperate regions of Australia."
  ],
  "tilia_x_euchlora": [
    "Tilia × euchlora, commonly called Caucasian linden or Crimean linden, is a medium size to a large deciduous tree that is thought to be a hybrid of Tilia cordata and Tilia dasystyla. The two species are native to Ukraine Crimea, but they do not share the same habitats. The parentage of the Crimean Linden remains unclear. It is a member of the Malvaceae family. The tree grows from 40-60 feet tall and 20-30 feet wide, and it has a pyramidal shape. The tree's crown is dense, and the branches are somewhat pendulous. The tree is also known as Caucasian Linden and Causcasina Lime.", 
    "This hybrid tree originated in Ukraine Crimea. The tree is sterile, and there are no similar hybrids found in the wild. The German botanist, Karl Koch, described the tree in 1866. His description is based on a young specimen that was found in Berlin. It was thought that the tree originated from a seed collected in Crimea. Since the tree is sterile, the trees in cultivation may be the result of a single clone."
  ],
  "liquidambar_species": [null],
  "eucalyptus_species": [null],
  "araucaria_araucana": [
    "Araucaria araucana is an evergreen tree growing to 1–1.5 m (3–5 ft) in diameter and 30–40 m (100–130 ft) in height. It is native to central and southern Chile and western Argentina. Araucaria araucana is the hardiest species in the conifer genus Araucaria. Because of the prevalence of similar species in ancient prehistory, it is sometimes called a living fossil. It is also the national tree of Chile. Its conservation status was changed to Endangered by the IUCN in 2013 due to the dwindling population caused by logging, forest fires, and grazing."
  ],
  "cornus_nuttallii": [
    "Cornus nuttallii, the Pacific dogwood, western dogwood, or mountain dogwood, is a species of dogwood tree native to western North America."
  ],
  "acer_saccharinum": [
    "Acer saccharinum, commonly known as silver maple, creek maple, silverleaf maple, soft maple, large maple, water maple, swamp maple, or white maple, is a species of maple native to the eastern and central United States and southeastern Canada. It is one of the most common trees in the United States."
  ],
  "trachycarpus_fortunei": [
    "Trachycarpus fortunei, the Chinese windmill palm, windmill palm or Chusan palm, is a species of hardy evergreen palm tree in the family Arecaceae, native to parts of China, Japan, Myanmar and India."
  ],
  "ilex_aquifolium": [
    "Ilex aquifolium, the holly, common holly, English holly, European holly, or occasionally Christmas holly, is a species of flowering plant in the family Aquifoliaceae, native to western and southern Europe, northwest Africa, and southwest Asia. It is regarded as the type species of the genus Ilex, which by association is also called \"holly\". It is an evergreen tree or shrub found, for example, in shady areas of forests of oak and in beech hedges. In the British Isles it is one of very few native evergreen trees. It has a great capacity to adapt to different conditions and is a pioneer species that repopulates the margins of forests or clearcuts."
  ],
  "prunus_salicina": [
    "Prunus salicina, commonly called the Japanese plum or Chinese plum, is a small deciduous tree native to China. It is now also grown in fruit orchards in Vietnam, Korea, Japan, the United States, and Australia."
  ],
  "pseudotsuga_menziesii": [
    "The Douglas fir is an evergreen conifer species in the pine family, Pinaceae. It is native to western North America and is also known as Douglas-fir, Douglas spruce, Oregon pine, and Columbian pine. There are three varieties: coast Douglas-fir, Rocky Mountain Douglas-fir and Mexican Douglas fir."
  ],
  "quercus_rubra": [
    "Quercus rubra, the northern red oak, is an oak tree in the red oak group. It is a native of North America, in the eastern and central United States and southeast and south-central Canada. It grows from the north end of the Great Lakes, east to Nova Scotia, south as far as Georgia, Mississippi, Alabama, and Louisiana, and west to Oklahoma, Kansas, Nebraska, and Minnesota. It has been introduced to small areas in Western Europe, where it can frequently be seen cultivated in gardens and parks. It prefers good soil that is slightly acidic. Often simply called red oak, northern red oak is so named to distinguish it from southern red oak, also known as the Spanish oak. It is sometimes called champion oak. It is also the state tree of New Jersey and the provincial tree of Prince Edward Island."
  ],
  "pinus_contorta": [
    "Pinus contorta, with the common names lodgepole pine and shore pine, and also known as twisted pine, and contorta pine, is a common tree in western North America. It is common near the ocean shore and in dry montane forests to the subalpine, but is rare in lowland rain forests. Like all pines, it is an evergreen conifer."
  ],
  "syringa_reticulata": [
    "Syringa reticulata, the Japanese tree lilac. is a species of flowering plant in the family Oleaceae native to eastern Asia, which is grown as an ornamental in Europe and North America."
  ],
  "magnolia_kobus": [
    "Magnolia kobus, known as mokryeon, kobus magnolia, or kobushi magnolia, is a species of Magnolia native to Japan and Korea and occasionally cultivated in temperate areas. It is a deciduous, small to tall tree which has a slow rate of growth but can reach 8–15 m (25–50 ft) in height and up to 10 m (35 ft) in spread."
  ],
  "cornus_xx": [null],
  "prunus_avium": [
    "Prunus avium, commonly called wild cherry, sweet cherry, gean, or bird cherry is a species of cherry, a flowering plant in the rose family, Rosaceae. It is native to Europe, Anatolia, Maghreb, and Western Asia, from the British Isles south to Morocco and Tunisia, north to the Trondheimsfjord region in Norway and east to the Caucasus and northern Iran, with a small isolated population in the western Himalaya. The species is widely cultivated in other regions and has become naturalized in North America and Australia."
  ],
  "acer_palmatum": [
    "Acer palmatum, commonly known as Japanese maple, palmate maple, or smooth Japanese maple, is a species of woody plant native to Japan, Korea, China, eastern Mongolia, and southeast Russia. Many different cultivars of this maple have been selected and they are grown worldwide for their large variety of attractive forms, leaf shapes, and spectacular colors."
  ],
  "chamaecyparis_species": [
    "Chamaecyparis, common names cypress or false cypress, is a genus of conifers in the cypress family Cupressaceae, native to eastern Asia and to the western and eastern margins of the United States. The name is derived from the Greek khamai (χαμαί), meaning \"on the earth\", and kuparissos (κυπάρισσος) for \"cypress\"."
  ],
  "metasequoia_glyptostroboides": [
    "Metasequoia glyptostroboides, the dawn redwood, is a fast-growing, endangered deciduous conifer. It is the sole living species of the genus Metasequoia, one of three genera in the subfamily Sequoioideae of the family Cupressaceae. It now survives only in wet lower slopes and montane river and stream valleys in the border region of Hubei and Hunan provinces and Chongqing municipality in south-central China, notably in Lichuan county in Hubei. Although the shortest of the redwoods, it can grow to 120 ft (37 m) in height."
  ],
  "acer_truncatum": [
    "Acer truncatum, the Shantung maple, Shandong maple, or purpleblow maple, is a maple native to northern China, in the provinces of Gansu, Hebei, Henan, Jiangsu, Jilin, Liaoning, Inner Mongolia, Shaanxi, Shandong, Shanxi, and to Korea."
  ],
  "magnolia_xx": [null],
  "cercis_canadensis": [
    "Cercis canadensis, the eastern redbud, is a large deciduous shrub or small tree, native to eastern North America from southern Michigan south to central Mexico, east to New Jersey. Species thrive as far west as California and as far north as southern Ontario, roughly corresponding to USDA hardiness zone 6b. It is the state tree of Oklahoma."
  ],
  "fraxinus_velutina": [
    "Fraxinus velutina, the velvet ash, Arizona ash or Modesto ash, is a species of Fraxinus native to southwestern North America, in the United States from southern California east to Texas, and in Mexico from northern Baja California east to Coahuila and Nuevo León."
  ],
  "quercus_phellos": [
    "Quercus phellos, the willow oak, is a North American species of a deciduous tree in the red oak group of oaks. It is native to the eastern and central United States from Long Island Sound south to northern Florida, and west to southernmost Illinois, Missouri, Oklahoma, and eastern Texas. It is most commonly found growing on lowland floodplains, often along streams, but rarely also in uplands with poor drainage, up to 400 meters (1,300 ft) altitude. Willow oak's natural range extends into southeastern Pennsylvania and southern New Jersey. The book Pennsylvania Trees (1928), written by state chief forester Joseph Illick, records willow oak as occurring in Lancaster, Bucks, Chester, Delaware, and Philadelphia counties, chiefly on wet sites, occasionally in drier, upland ones. Much of that area has been built over and developed since World War II, and the tree is now classified as endangered in the state."
  ],
  "liquidambar_styraciflua": [
    "American sweetgum, also known as American storax, hazel pine, bilsted, redgum, satin-walnut, star-leaved gum, alligatorwood, or simply sweetgum, is a deciduous tree in the genus Liquidambar native to warm temperate areas of eastern North America and tropical montane regions of Mexico and Central America. Sweet gum is one of the main valuable forest trees in the southeastern United States, and is a popular ornamental tree in temperate climates. It is recognizable by the combination of its five-pointed star-shaped leaves and its hard, spiked fruits. It is currently classified in the plant family Altingiaceae, but was formerly considered a member of the Hamamelidaceae."
  ],
  "fraxinus_americana": [
    "Fraxinus americana, the white ash or American ash, is a species of ash tree native to eastern and central North America."
  ],
  "pinus_sylvestris": [
    "Pinus sylvestris, Scots pine (UK), Scotch pine (US), European red pine, or Baltic pine is a species of tree in the pine family Pinaceae that is native to Eurasia, ranging from Western Europe to Eastern Siberia, south to the Caucasus Mountains and Anatolia, and north to well inside the Arctic Circle in Fennoscandia. In the north of its range, it occurs from sea level to 1,000 m (3,300 ft), while in the south of its range it is a mountain tree, growing at 1,200–2,600 m (3,900–8,500 ft) altitude. It is readily identified by its combination of fairly short, blue-green leaves and orange-red bark."
  ],
  "quercus_palustris": [
    "Quercus palustris, the pin oak or swamp Spanish oak, is a tree in the red oak section of the genus Quercus. Pin oak is one of the most commonly used landscaping oaks in its native range due to its ease of transplant, relatively fast growth, and pollution tolerance. Its distinctive shape is considered unique among hardwoods."
  ],
  "fagus_sylvatica": [
    "European beech or common beech is a deciduous tree belonging to the beech family Fagaceae."
  ],
  "prunus_blireana": [
    "Prunus × blireiana, the purple-leafed plum or double-flowering plum, is an ornamental flowering plant hybrid in the genus Prunus. It is a cross between the Japanese apricot and the purple-leaved plum cultivar Prunus cerasifera 'Pissardii'."
  ],
  "prunus_domestica": [
    "Prunus domestica, the European plum is a species of flowering plant in the family Rosaceae. A deciduous tree, it includes many varieties of the fruit trees known as plums in English, though not all plums belong to this species. The greengages and damsons also belong to subspecies of P. domestica."
  ],
  "prunus_species": [
    "The following species in the genus Prunus are recognised by Plants of the World Online:"
  ],
  "cornus_florida": [
    "Cornus florida, the flowering dogwood, is a species of flowering tree in the family Cornaceae native to eastern North America and northern Mexico. An endemic population once spanned from southernmost coastal Maine south to northern Florida and west to the Mississippi River. The tree is commonly planted as an ornamental in residential and public areas because of its showy bracts and interesting bark structure."
  ],
  "pinus_species": [
    "Pinus, the pines, is a genus of approximately 111 extant tree and shrub species. The genus is currently split into two subgenera: subgenus Pinus, and subgenus Strobus. Each of the subgenera have been further divided into sections based on chloroplast DNA sequencing and whole plastid genomic analysis. Older classifications split the genus into three subgenera – subgenus Pinus, subgenus Strobus, and subgenus Ducampopinus – based on cone, seed and leaf characteristics. DNA phylogeny has shown that species formerly in subgenus Ducampopinus are members of subgenus Strobus, so Ducampopinus is no longer used.\n"
  ],
  "tsuga_canadensis": [
    "Tsuga canadensis, also known as eastern hemlock, eastern hemlock-spruce, or Canadian hemlock, and in the French-speaking regions of Canada as pruche du Canada, is a coniferous tree native to eastern North America. It is the state tree of Pennsylvania."
  ],
  "populus_species": [null],
  "crataegus_phaenopyrum": [
    "Crataegus phaenopyrum is a species of hawthorn commonly known as Washington hawthorn or Washington thorn. It is widely grown as an ornamental plant, and can reach 10 m in height. The small red berry-like fruit grow closely together in large clusters and are food for squirrels and birds. They have a mild flavor and can be eaten raw or cooked. As with other species of hawthorn, the wood is hard and can be used to make tools."
  ],
  "catalpa_speciosa": [
    "Catalpa speciosa, commonly known as the northern catalpa, hardy catalpa, western catalpa, cigar tree, catawba-tree,\n or bois chavanon, is a species of Catalpa native to the midwestern United States."
  ],
  "catalpa_bignonioides": [
    "Catalpa bignonioides is a species of Catalpa that is native to the southeastern United States in Alabama, Florida, Georgia, Louisiana, and Mississippi. Common names include southern catalpa, cigartree, and Indian-bean-tree."
  ],
  "robinia_pseudoacacia": [
    "Robinia pseudoacacia, commonly known in its native territory as black locust, is a medium-sized hardwood deciduous tree, belonging to the tribe Robinieae. It is endemic to a few small areas of the United States, but it has been widely planted and naturalized elsewhere in temperate North America, Europe, Southern Africa and Asia and is considered an invasive species in some areas. Another common name is false acacia, a literal translation of the specific name."
  ],
  "abies_grandis": [
    "Abies grandis is a fir native to the Pacific Northwest and Northern California of North America, occurring at altitudes of sea level to 1,800 m. It is a major constituent of the Grand Fir/Douglas Fir Ecoregion of the Cascade Range."
  ],
  "aesculus_hippocastanum": [
    "Aesculus hippocastanum, the horse chestnut, is a species of flowering plant in the soapberry and lychee family Sapindaceae. It is a large deciduous, synoecious (hermaphroditic-flowered) tree. It is also called horse-chestnut, European horsechestnut, buckeye, and conker tree. It is sometimes called Spanish chestnut. This name is typically used for Castanea sativa."
  ],
  "sorbus_americana": [
    "The tree species Sorbus americana is commonly known as the American mountain-ash. It is a deciduous perennial tree, native to eastern North America."
  ],
  "fraxinus_excelsior": [
    "Fraxinus excelsior, known as the ash, or European ash or common ash to distinguish it from other types of ash, is a flowering plant species in the olive family Oleaceae. It is native throughout mainland Europe east to the Caucasus and Alborz mountains, and the British Isles which determine its western boundary. The northernmost location is in the Trondheimsfjord region of Norway. The species is widely cultivated and reportedly naturalised in New Zealand and in scattered locales in the United States and Canada."
  ],
  "prunus_sargentii": [
    "Prunus sargentii, commonly known as Sargent's cherry or North Japanese hill cherry, is a species of cherry native to Japan, Korea, and Sakhalin (Russia)."
  ],
  "cornus_mas": [
    "Cornus mas, the Cornelian cherry, European cornel or Cornelian cherry dogwood, is a species of flowering plant in the dogwood family Cornaceae, native to Southern Europe and Southwestern Asia."
  ],
  "tilia_cordata": [
    "Tilia cordata, the small-leaved lime or small-leaved linden, is a species of tree in the family Malvaceae, native to much of Europe. Other common names include little-leaf or littleleaf linden, small-leaved linden, or traditionally in South East England, pry or pry tree. Its range extends from Britain through mainland Europe to the Caucasus and western Asia. In the south of its range it is restricted to high elevations."
  ],
  "cercidiphyllum_japonicum": [
    "Cercidiphyllum japonicum, known as the katsura, is a species of flowering tree in the family Cercidiphyllaceae native to China and Japan. It is sometimes called caramel tree for the light caramel smell it emits during leaf fall."
  ],
  "chamaecyparis_pisifera": [
    "Chamaecyparis pisifera is a species of false cypress, native to central and southern Japan, on the islands of Honshū and Kyūshū."
  ],
  "tilia_americana": [
    "Tilia americana is a species of tree in the family Malvaceae, native to eastern North America, from southeast Manitoba east to New Brunswick, southwest to northeast Oklahoma, southeast to South Carolina, and west along the Niobrara River to Cherry County, Nebraska. It is the sole representative of its genus in the Western Hemisphere, assuming T. caroliniana is treated as a subspecies or local ecotype of T. americana. Common names include American basswood and American linden."
  ],
  "platanus_x_acerifolia": [
    "Platanus × acerifolia, the London plane, London planetree, or hybrid plane, is a tree in the genus Platanus. It is often known by the synonym Platanus × hispanica. It is usually thought to be a hybrid of Platanus orientalis and Platanus occidentalis. Some authorities think that it may be a cultivar of P. orientalis."
  ],
  "nothofagus_antartica": [null],
  "acer_griseum": [
    "Acer griseum, the paperbark maple, is a species of flowering plant in the family Sapindaceae, native to central China. Acer griseum is found in the Chinese provinces of Gansu, Henan, Hubei, Hunan, Shaanxi, Shanxi and Sichuan, at altitudes of 1,500–2,000 m (4,921–6,562 ft)."
  ],
  "acer_species": [null],
  "populus_trichocarpa": [
    "Populus trichocarpa, the black cottonwood, western balsam-poplar or California poplar, is a deciduous broadleaf tree species native to western North America. It is used for timber, and is notable as a model organism in plant biology."
  ],
  "amelanchier_x_grandiflora": [
    "Amelanchier × grandiflora, the serviceberry, is a small deciduous flowering tree or large shrub, a hybrid of garden origin between A. arborea and A. laevis, in the family Rosaceae. It produces white flowers and small red to purple edible fruits."
  ],
  "prunus_virginiana": [
    "Prunus virginiana, commonly called bitter-berry, chokecherry, Virginia bird cherry, and western chokecherry, is a species of bird cherry native to North America. The natural historic range of P. virginiana includes most of Canada, most of the United States, and northern Mexico."
  ],
  "chamaecyparis_lawsoniana": [
    "Chamaecyparis lawsoniana, known as Port Orford cedar or Lawson cypress, is a species of conifer in the genus Chamaecyparis, family Cupressaceae. It is native to Oregon and northwestern California, and grows from sea level up to 1,500 m (4,900 ft) in the valleys of the Klamath Mountains, often along streams."
  ],
  "malus_species": [null],
  "malus_xx": [null],
  "rhus_typhina": [
    "Rhus typhina, the staghorn sumac, is a species of flowering plant in the family Anacardiaceae, native to eastern North America. It is primarily found in southeastern Canada, the northeastern and midwestern United States, and the Appalachian Mountains, but it is widely cultivated as an ornamental throughout the temperate world."
  ],
  "quercus_robur": [
    "Quercus robur, commonly known as common oak, pedunculate oak, European oak or English oak, is a species of flowering plant in the beech and oak family, Fagaceae. It is native to most of Europe west of the Caucasus. The tree is widely cultivated in temperate regions and has escaped into the wild in scattered parts of China and North America."
  ],
  "acer_negundo": [
    "Acer negundo, the box elder, boxelder maple, Manitoba maple or ash-leaved maple, is a species of maple native to North America. It is a fast-growing, short-lived tree with opposite, compound leaves. It is sometimes considered a weedy or invasive species, and has been introduced to and naturalized throughout much of the world, including in South America, Australia, New Zealand, South Africa, much of Europe, and parts of Asia."
  ],
  "acer_circinatum": [
    "Acer circinatum, the vine maple, is a species of maple native to western North America, from southwest British Columbia to northern California, usually within 300 kilometres (190 mi) of the Pacific Ocean coast, found along the Columbia Gorge and Coastal Forest. It belongs to the Palmatum group of maple trees native to East Asia with its closest relatives being the Acer japonicum and Acer pseudosieboldianum. It can be difficult to distinguish from these species in cultivation. It is the only member of the Palmatum group that resides outside of Asia."
  ],
  "sorbus_aria": [
    "Sorbus aria, the whitebeam or common whitebeam, is a European and Near-Eastern deciduous tree, the type species of the subgenus of the whitebeams. Typically compact and domed, with few upswept branches and almost-white underside of the leaves, it generally favours dry limestone and chalk soils. The hermaphrodite cream-white flowers appear in May, are insect pollinated, and go on to produce scarlet berries, which are often eaten by birds."
  ],
  "catalpa_species": [
    "Catalpa, commonly called catalpa or catawba, is a genus of flowering plants in the family Bignoniaceae, native to warm temperate and subtropical regions of North America, the Caribbean, and East Asia."
  ],
  "quercus_ellipsoidalis": [
    "Quercus ellipsoidalis, the northern pin oak or Hill's oak, is a North American species of tree native to the north-central United States and south-central Canada, primarily in the Great Lakes region and the Upper Mississippi Valley. It most commonly occurs on dry, sandy soils."
  ],
  "ulmus_glabra": [
    "Ulmus glabra, the wych elm or Scots elm, has the widest range of the European elm species, from Ireland eastwards to the Urals, and from the Arctic Circle south to the mountains of the Peloponnese in Greece; it is also found in Iran. A large deciduous tree, it is essentially a montane species, growing at elevations up to 1,500 m (4,900 ft), preferring sites with moist soils and high humidity. The tree can form pure forests in Scandinavia and occurs as far north as latitude 67°N at Beiarn in Norway. It has been successfully introduced as far north as Tromsø, Norway and Alta, Norway (70°N). It has also been successfully introduced to Narsarsuaq, near the southern tip of Greenland (61°N)."
  ],
  "ulmus_procera": [
    "The field elm cultivar 'Atinia' , commonly known as the English elm, formerly common elm and horse may, and more lately the Atinian elm was, before the spread of Dutch elm disease, the most common field elm in central southern England, though not native there, and one of the largest and fastest-growing deciduous trees in Europe. R. H. Richens noted that elm populations exist in north-west Spain and northern Portugal, and on the Mediterranean coast of France that \"closely resemble the English elm\" and appear to be \"trees of long standing\" in those regions rather than recent introductions. Augustine Henry had earlier noted that the supposed English elms planted extensively in the Royal Park at Aranjuez from the late 16th century onwards, specimens said to have been introduced from England by Philip II and \"differing in no respects from the English elm in England\", behaved as native trees in Spain. He suggested that the tree \"may be a true native of Spain, indigenous in the alluvial plains of the great rivers, now almost completely deforested\"."
  ],
  "zelkova_serrata": [
    "Zelkova serrata is a species of the genus Zelkova native to Japan, Korea, eastern China and Taiwan. It is often grown as an ornamental tree, and used in bonsai. There are two varieties, Zelkova serrata var. serrata in Japan and mainland eastern Asia, and Zelkova serrata var. tarokoensis (Hayata) Li on Taiwan which differs from the type in its smaller leaves with less deeply cut serration on the margins."
  ],
  "crataegus_mordensis": [
    "Crataegus × mordenensis (Morden hawthorn) is a hybrid that arose between two species in the genus Crataegus (Hawthorn), Crataegus laevigata and Crataegus succulenta. This hybrid was first raised at the Agriculture Canada Plant Breeding Station in Morden, Manitoba, in 1935.",
    "Two cultivars of this hybrid are significant in horticulture: 'Toba', with white double flowers that age to pink, and 'Snowbird' with white double flowers."
  ],
  "crataegus_x_lavallei": [
    "Crataegus × lavalleei, sometimes known as hybrid cockspurthorn or Lavallée's hawthorn, is a hybrid that arose between cultivated specimens of two species in the genus Crataegus (Hawthorn). It is an ornamental small tree with glossy dark green unlobed leaves that is used horticulturally."
  ],
  "fraxinus_angustifolia": [
    "Fraxinus angustifolia, the narrow-leafed ash, is a species of Fraxinus native to central and southern Europe, northwest Africa, and southwest Asia."
  ],
  "populus_alba": [
    "Populus alba, commonly called silver poplar, silverleaf poplar, or white poplar, is a species of poplar, most closely related to the aspens. It is native to Morocco and then Spain through central Europe to central Asia. It grows in moist sites, often by watersides, in regions with hot summers and cold to mild winters."
  ],
  "magnolia_liliiflora": [
    "Magnolia liliiflora is a small tree native to southwest China, but cultivated for centuries elsewhere in China and also Japan. Variously known by many names, including Mulan magnolia, purple magnolia, red magnolia, lily magnolia, tulip magnolia, Jane magnolia and woody-orchid, it was first introduced to English-speaking countries from cultivated Japanese origins, and is thus also sometimes called Japanese magnolia, though it is not native to Japan. It is now also planted as an ornamental in North America and Europe, though rather less often than its popular hybrid."
  ],
  "quercus_acutissima": [
    "Quercus acutissima, the sawtooth oak, is an Asian species of oak native to China, Tibet, Korea, Japan, Indochina and the Himalayas. It is widely planted in many lands and has become naturalized in parts of North America."
  ],
  "acer_ginnala": [
    "Acer ginnala, the Amur maple, is a plant species with woody stems native to northeastern Asia from easternmost Mongolia east to Korea and Japan, and north to the Russian Far East in the Amur River valley. It is a small maple with deciduous leaves that is sometimes grown as a garden subject or boulevard tree."
  ],
  "carpinus_japonica": [
    "Carpinus japonica, the Japanese hornbeam, is a hornbeam endemic to Japan but cultivated elsewhere as an ornamental."
  ],
  "pyrus_calleryana": [
    "Pyrus calleryana, or the Callery pear, is a species of pear tree native to China and Vietnam, in the family Rosaceae. It is most commonly known for its cultivar 'Bradford', widely planted throughout the United States and increasingly regarded as an invasive species."
  ],
  "fraxinus_oxycarpa": [
    "Fraxinus angustifolia, the narrow-leafed ash, is a species of Fraxinus native to central and southern Europe, northwest Africa, and southwest Asia."
  ],
  "malus_baccata": [
    "Malus baccata is an Asian species of apple known by the common names Siberian crab apple, Siberian crab, Manchurian crab apple and Chinese crab apple. It is native to much of northern Asia, but is also grown elsewhere as an ornamental tree and for rootstock. It is used for bonsai. It bears plentiful fragrant white flowers and edible red to yellow fruit of about 1 cm diameter."
  ],
  "betula_papyrifera": [
    "Betula papyrifera is a short-lived species of birch native to northern North America. Paper birch is named for the tree's thin white bark, which often peels in paper like layers from the trunk. Paper birch is often one of the first species to colonize a burned area within the northern latitudes, and is an important species for moose browsing. The wood is often used for pulpwood and firewood."
  ],
  "fraxinus_pennsylvanica": [
    "Fraxinus pennsylvanica, the green ash or red ash, is a species of ash native to eastern and central North America, from Nova Scotia west to southeastern Alberta and eastern Colorado, south to northern Florida, and southwest to Oklahoma and eastern Texas. It has spread and become naturalized in much of the western United States and also in Europe from Spain to Russia."
  ],
  "catalpa_x_hybrida": [null],
  "carpinus_caroliniana": [
    "Carpinus caroliniana, the American hornbeam, is a small hardwood tree in the genus Carpinus. American hornbeam is also known as blue-beech, and musclewood. It is native to eastern North America, from Minnesota and southern Ontario east to Maine, and south to eastern Texas and northern Florida. It also grows in Canada."
  ],
  "picea_pungens": [
    "The blue spruce, also commonly known as green spruce, white spruce, Colorado spruce, or Colorado blue spruce, is a species of spruce tree. It is native to North America, and is found in USDA growing zones 1 through 7. Its natural range extends from northern New Mexico through Colorado and Utah to Wyoming and into Alberta and British Columbia, but it has been widely introduced elsewhere and is used as an ornamental tree in many places far beyond its native range. The blue spruce has blue-green coloured needles and is a coniferous tree."
  ],
  "prunus_subhirtella": [
    "Prunus subhirtella or Edo higan, is the scientific name for one of the wild species of cherry trees native to Japan, and is also the name given to the cultivars derived from this species. The scientific name for the hybrid between this species and Prunus incisa is Prunus × subhirtella. Historically, the Japanese have produced many cultivars from this wild species, and they are also called weeping cherry, autumn cherry, or winter- flowering cherry, because of the characteristics of each cultivar."
  ],
  "castanea_sativa": [
    "Castanea sativa, the sweet chestnut, Spanish chestnut or just chestnut, is a species of tree in the family Fagaceae, native to Southern Europe and Asia Minor, and widely cultivated throughout the temperate world. A substantial, long-lived deciduous tree, it produces an edible seed, the chestnut, which has been used in cooking since ancient times."
  ],
  "aesculus_x_carnea": [
    "Aesculus × carnea, or red horse-chestnut, is a medium-sized tree, an artificial hybrid between A. pavia and A. hippocastanum (horse-chestnut). Its origin uncertain, probably appearing in Germany before 1820. It is a popular tree in large gardens and parks."
  ],
  "acer_saccharum": [
    "Acer saccharum, the sugar maple, is a species of flowering plant in the soapberry and lychee family Sapindaceae. It is native to the hardwood forests of eastern Canada, from Nova Scotia west through southern Quebec, central and southern Ontario to southeastern Manitoba around Lake of the Woods, and northcentral and northeastern United States, from Minnesota eastward to Maine and southward to northern Virginia, Tennessee and Missouri. Sugar maple is best known for being the primary source of maple syrup and for its brightly colored fall foliage. It may also be known as \"rock maple\", \"sugar tree\", \"birds-eye maple\", \"sweet maple\", \"curly maple\", or \"hard maple\", particularly when referring to the wood."
  ],
  "fagus_crenata": [
    "Fagus crenata, known as the Siebold's beech, Japanese beech, or buna, is a deciduous tree of the beech genus, Fagus, of the family Fagaceae."
  ],
  "acer_japonicum": [
    "Acer japonicum, the Amur maple, downy Japanese-maple or fullmoon maple, is a species of maple native to Japan, on Honshū, Hokkaidō, Kyūshū, and also southern Korea."
  ],
  "cedrus_species": [
    "Cedrus, common English name cedar, is a genus of coniferous trees in the plant family Pinaceae. They are native to the mountains of the western Himalayas and the Mediterranean region, occurring at altitudes of 1,500–3,200 m in the Himalayas and 1,000–2,200 m in the Mediterranean."
  ],
  "abies_balsamea": [
    "Abies balsamea or balsam fir is a North American fir, native to most of eastern and central Canada and the northeastern United States."
  ],
  "cedrus_deodara": [
    "Cedrus deodara, the deodar cedar, Himalayan cedar, or deodar/ devdar/ devadar/ devadaru, is a species of cedar native to the western Himalayas in Eastern Afghanistan, Northern Pakistan, and India, Southwestern Tibet, and Western Nepal occurring at 1,500–3,200 m (4,921–10,499 ft) altitude."
  ],
  "juglans_species": [
    "Walnut trees are any species of tree in the plant genus Juglans, the type genus of the family Juglandaceae, the seeds of which are referred to as walnuts. All species are deciduous trees, 10–40 metres (33–131 ft) tall, with pinnate leaves 200–900 millimetres (7.9–35.4 in), with 5–25 leaflets; the shoots have chambered pith, a character shared with the wingnuts (Pterocarya), but not the hickories (Carya) in the same family."
  ],
  "thuja_species": [null],
  "chamaecyparis_obtusa": [
    "Chamaecyparis obtusa is a species of cypress native to central Japan in East Asia, and widely cultivated in the temperate northern hemisphere for its high quality timber and ornamental qualities, with many cultivars commercially available."
  ],
  "betula_nigra": [
    "Betula nigra, the black birch, river birch or water birch, is a species of birch native to the Eastern United States from New Hampshire west to southern Minnesota, and south to northern Florida and west to Texas. It is one of the few heat-tolerant birches in a family of mostly cold-weather trees which do not thrive in USDA Zone 6 and up. B. nigra commonly occurs in floodplains and swamps."
  ],
  "acer_davidii": [
    "Acer davidii, or Père David's maple, is a species of maple in the snakebark maple group. It is native to China, from Jiangsu south to Fujian and Guangdong, and west to southeastern Gansu and Yunnan."
  ],
  "crataegus_xx": [null],
  "laburnum_anagyroides": [
    "Laburnum anagyroides, the common laburnum, golden chain or golden rain, is a species in the subfamily Faboideae, and genus Laburnum. Laburnum alpinum is closely related. It is native to Central and Southern Europe."
  ],
  "crataegus_species": [
    "Crataegus, commonly called hawthorn, quickthorn, thornapple, May-tree, whitethorn, or hawberry, is a genus of several hundred species of shrubs and trees in the family Rosaceae, native to temperate regions of the Northern Hemisphere in Europe, Asia, North Africa, and North America. The name \"hawthorn\" was originally applied to the species native to northern Europe, especially the common hawthorn C. monogyna, and the unmodified name is often so used in Britain and Ireland. The name is now also applied to the entire genus and to the related Asian genus Rhaphiolepis."
  ],
  "acer_cappadocicum": [
    "Acer cappadocicum, the Cappadocian maple, is a maple native to Asia, from central Turkey east along the Caucasus, the Himalaya, to southwestern China."
  ],
  "thuja_occidentalis": [
    "Thuja occidentalis, also known as northern white cedar, eastern white cedar, or arborvitae, is an evergreen coniferous tree, in the cypress family Cupressaceae, which is native to eastern Canada and much of the northcentral and northeastern United States. It is widely cultivated as an ornamental plant."
  ],
  "tilia_platyphyllos": [
    "Tilia platyphyllos, the large-leaved lime or large-leaved linden, is a species of flowering plant in the family Malvaceae (Tiliaceae). It is a deciduous tree, native to much of Europe, including locally in southwestern Great Britain, growing on lime-rich soils. The common names largeleaf linden and large-leaved linden are in standard use throughout the English-speaking world except in the British Isles, where it is known as large-leaved lime. The name \"lime\", possibly a corruption of \"line\" originally from \"lind\", has been in use for centuries and also attaches to other species of Tilia. It is not, however, closely related to the lime fruit tree, a species of citrus."
  ],
  "prunus_x_hillieri": [
    "Prunus × hillieri is the result of a cross between Prunus incisa (Fuji cherry) and Prunus sargentii (hill cherry). The most famous cultivar is 'Spire', which was developed from a sport discovered growing in Hillier and Sons nursery of Winchester. Growing to 10 m (33 ft), with at most a 7 m (23 ft) spread, 'Spire's columnar growth form and pink flowers make it quite useful in particular landscaping applications. It is regularly used as a street tree. In 1993 'Spire' won the Royal Horticultural Society's Award of Garden Merit."
  ],
  "crataegus_douglasii": [
    "Crataegus douglasii is a North American species of hawthorn known by the common names black hawthorn and Douglas' thornapple. It is named after David Douglas, who collected seed from the plant during his botanical explorations."
  ],
  "tilia_x_europaea": [
    "Tilia × europaea, generally known as the common lime or common linden, is a naturally occurring hybrid between Tilia cordata and Tilia platyphyllos. It occurs in the wild in Europe at scattered localities wherever the two parent species are both native. It is not closely related to the lime fruit tree, a species of citrus."
  ],
  "sorbus_vilmorinii": [
    "Sorbus vilmorinii, the Vilmorin's rowan or Vilmorin's mountain ash, is a species of flowering plant in the family Rosaceae, native to Sichuan, Tibet and Yunnan in China."
  ],
  "juniperus_communis": [
    "Juniperus communis, the common juniper, is a species of small tree or shrub in the genus Juniperus, in the family Cupressaceae. This evergreen conifer has the largest geographical range of any woody plant, with a circumpolar distribution throughout the cool temperate Northern Hemisphere from the Arctic south in mountains to around 30°N latitude in North America, Europe and Asia. Relict populations can be found in the Atlas Mountains of Africa."
  ],
  "quercus_coccinea": [
    "Quercus coccinea, the scarlet oak, is an oak in the red oak section Quercus sect. Lobatae. The scarlet oak can be mistaken for the pin oak, the black oak, or occasionally the red oak. On scarlet oak the sinuses between lobes are \"C\"-shaped in comparison to pin oak, which has \"U\"-shaped sinuses and the acorns are half covered by a deep cap."
  ],
  "stewartia_pseudocamellia": [
    "Stewartia pseudocamellia, also known as Korean stewartia, Japanese stewartia, or deciduous camellia, is a \nspecies of flowering plant in the family Theaceae, native to Japan and Korea."
  ],
  "magnolia_x_kewensis": [null],
  "sorbus_aucuparia": [
    "Sorbus aucuparia, commonly called rowan and mountain-ash, is a species of deciduous tree or shrub in the rose family. It is a highly variable species, and botanists have used different definitions of the species to include or exclude trees native to certain areas; a recent definition includes trees native to most of Europe and parts of Asia, as well as northern Africa. The range extends from Madeira, the British Isles and Iceland to Russia and northern China. Unlike many plants with similar distributions, it is not native to Japan."
  ],
  "magnolia_sieboldii": [
    "Magnolia sieboldii, or Siebold's magnolia, also known as Korean mountain magnolia and Oyama magnolia, is a species of Magnolia native to east Asia in China, Japan, and Korea. It is named after the German doctor Philipp Franz von Siebold (1796–1866)."
  ],
  "ilex_species": [
    "Ilex, or holly, is a genus of about 480 species of flowering plants in the family Aquifoliaceae, and the only living genus in that family. The species are evergreen or deciduous trees, shrubs, and climbers from tropics to temperate zones worldwide. The type species is Ilex aquifolium, the common European holly used in Christmas decorations and cards."
  ],
  "hibiscus_syriaca": [
    "Hibiscus syriacus, commonly called rose of Sharon or shrub althea, is a vigorous, upright, vase-shaped, multi-stemmed, deciduous shrub that typically grows 8-12’ tall. It may be trained as a small tree or espalier. Showy, hollyhock-like, 5-petaled flowers (to 3” diameter) appear over a long, early-summer to fall bloom period. Each flower has a prominent and showy center staminal column. Palmately-veined, coarsely-toothed, three-lobed, medium green leaves (to 4” long) are attractive during the growing season but produce no fall color."
  ],
  "picea_abies": [
    "Picea abies, the Norway spruce or European spruce, is a species of spruce native to Northern, Central and Eastern Europe. It has branchlets that typically hang downwards, and the largest cones of any spruce, 9–17 cm long. It is very closely related to the Siberian spruce, which replaces it east of the Ural Mountains, and with which it hybridises freely. The Norway spruce is widely planted for its wood, and is the species used as the main Christmas tree in several countries around the world. It was the first gymnosperm to have its genome sequenced. The Latin specific epithet abies means “fir-like”."
  ],
  "prunus_serotina": [
    "Prunus serotina, commonly called black cherry, wild black cherry, rum cherry, or mountain black cherry, is a deciduous tree or shrub of the genus Prunus. Despite being called black cherry, it is not very closely related to the commonly cultivated cherries such as sweet cherry, sour cherry and Japanese flowering cherries which belong to Prunus subg. Cerasus. Instead, P. serotina belongs to Prunus subg. Padus, a subgenus also including Eurasian bird cherry and chokecherry. The species is widespread and common in North America and South America."
  ],
  "magnolia_denudata": [
    "Magnolia denudata, the lilytree or Yulan magnolia, is native to central and eastern China. It has been cultivated in Chinese Buddhist temple gardens since 600 AD. Its flowers were regarded as a symbol of purity in the Tang Dynasty and it was planted in the grounds of the Emperor's palace. It is the official city flower of Shanghai."
  ],
  "crataegus_monogyna": [
    "Crataegus monogyna, known as common hawthorn, oneseed hawthorn, or single-seeded hawthorn, is a species of flowering plant in the rose family Rosaceae. It is native to Europe, northwestern Africa and West Asia, but has been introduced in many other parts of the world."
  ],
  "ginkgo_biloba": [
    "Ginkgo biloba, commonly known as ginkgo or gingko, also known as the maidenhair tree, is a species of tree native to China. It is the only living species in the order Ginkgoales, which first appeared over 290 million years ago. Fossils very similar to the living species, belonging to the genus Ginkgo, extend back to the Middle Jurassic approximately 170 million years ago. It is the oldest tree species in the world. The tree is widely cultivated, and was cultivated early in human history."
  ],
  "corylus_species": [
    "Hazel is a genus of nut-bearing trees and shrubs, including common hazel."
  ],
  "juglans_regia": [
    "Juglans regia, the Persian walnut, English walnut, Carpathian walnut, Madeira walnut, or especially in Great Britain, common walnut, is an Old World walnut tree species native to the region stretching from the Balkans eastward to the Himalayas and southwest China. It is widely cultivated across Europe."
  ],
  "fraxinus_species": [
    "Fraxinus, English name ash, is a genus of flowering plants in the olive and lilac family, Oleaceae. It contains 45–65 species of usually medium to large trees, mostly deciduous, though a number of subtropical species are evergreen. The genus is widespread across much of Europe, Asia, and North America."
  ],
  "chamaecyparis_nootkatensis": [
    "Cupressus nootkatensis is a species of trees in the cypress family native to the coastal regions of northwestern North America. This species goes by many common names including: Nootka cypress, yellow cypress, Alaska cypress, Nootka cedar, yellow cedar, Alaska cedar, and Alaska yellow cedar. The specific epithet \"nootkatensis\" is derived from its discovery by Europeans on the lands of a First Nation of Canada, those lands of the Nuu-chah-nulth people of Vancouver Island, British Columbia, who were formerly referred to as the Nootka."
  ],
  "aesculus_x_arnoldiana": [null],
  "styrax_obassia": [
    "Styrax obassia is a species of flowering plant in the Styracaceae family. It is native to Hokkaido island of Japan and to China."
  ],
  "alnus_rugosa": [
    "Alnus incana, the grey alder or speckled alder, is a species of tree in the birch family, with a wide range across the cooler parts of the Northern Hemisphere."
  ],
  "populus_nigra": [
    "Populus nigra, the black poplar, is a species of cottonwood poplar, the type species of section Aigeiros of the genus Populus, native to Europe, southwest and central Asia, and northwest Africa."
  ],
  "tsuga_heterophylla": [
    "Tsuga heterophylla, the western hemlock or western hemlock-spruce, is a species of hemlock native to the west coast of North America, with its northwestern limit on the Kenai Peninsula, Alaska, and its southeastern limit in northern Sonoma County, California."
  ],
  "cornus_controversa": [
    "Cornus controversa, syn. Swida controversa, is a species of flowering plant in the genus Cornus of the dogwood family Cornaceae, native to China, Korea, the Himalayas and Japan. It is a deciduous tree growing to 50 ft (15 m), with multiple tiered branches. Flat panicles of white flowers appear in summer, followed by globose black fruit. Ovate dark green leaves are glaucous underneath and turn red-purple in autumn. It is cultivated in gardens and parks in temperate regions."
  ],
  "juglans_nigra": [
    "Juglans nigra, the eastern American black walnut, is a species of deciduous tree in the walnut family, Juglandaceae, native to North America. It grows mostly in riparian zones, from southern Ontario, west to southeast South Dakota, south to Georgia, northern Florida and southwest to central Texas. Wild trees in the upper Ottawa Valley may be an isolated native population or may have derived from planted trees."
  ],
  "taxus_baccata": [
    "Taxus baccata is a species of evergreen tree in the family Taxaceae, native to western, central and southern Europe, northwest Africa, northern Iran and southwest Asia. It is the tree originally known as yew, though with other related trees becoming known, it may now be known as common yew, English yew, or European yew. It is primarily grown as an ornamental. Most parts of the plant are poisonous, and consumption of the foliage can result in death."
  ],
  "picea_sitchensis": [
    "Picea sitchensis, the Sitka spruce, is a large, coniferous, evergreen tree growing to almost 100 m (330 ft) tall, with a trunk diameter at breast height that can exceed 5 m (16 ft). It is by far the largest species of spruce and the fifth-largest conifer in the world ; and the third-tallest conifer species. The Sitka spruce is one of the few species documented to exceed 300 ft (90 m) in height. Its name is derived from the community of Sitka in southeast Alaska, where it is prevalent. Its range hugs the western coast of Canada and the US, continuing south into northernmost California."
  ],
  "pyrus_species": [null],
  "gymnocladus_dioicus": [
    "The Kentucky coffeetree, Gymnocladus dioicus, is a tree in the subfamily Caesalpinioideae of the legume family Fabaceae, native to the Midwest and Upper South of North America. The seed may be roasted and used as a substitute for coffee beans; however, unroasted pods and seeds are toxic. The wood from the tree is used by cabinetmakers and carpenters. It is planted as a street tree."
  ],
  "nyssa_sylvatica": [
    "Nyssa sylvatica, commonly known as tupelo, black tupelo, black gum or sour gum, is a medium-sized deciduous tree native to eastern North America from the coastal Northeastern United States and southern Ontario south to central Florida and eastern Texas, as well as Mexico."
  ],
  "davidia_involucrata": [
    "Davidia involucrata, the dove-tree, handkerchief tree, pocket handkerchief tree, or ghost tree, is a medium-sized deciduous tree in the family Nyssaceae. It was previously included with tupelos in the dogwood family, Cornaceae. It is native to South Central and Southwest China from Hubei to southern Gansu, south to Guizhou, Sichuan and Yunnan, but is widely cultivated elsewhere."
  ],
  "carpinus_species": [null],
  "fraxinus_latifolia": [
    "Fraxinus latifolia, the Oregon ash, is a member of the ash genus Fraxinus, native to western North America."
  ],
  "picea_omorika": [
    "Picea omorika, common name Pančić spruce or Serbian spruce, is a species of coniferous tree endemic to the Drina River valley in western Serbia, and eastern Bosnia and Herzegovina, with a total range of only about 60 ha, at 800–1,600 m (2,625–5,249 ft) altitude. It was originally discovered near the Serbian village of Zaovine, on Mount Tara, in 1875, and named by the Serbian botanist Josif Pančić; the specific epithet omorika is simply the Serbian word for \"Serbian spruce\". All other spruces are smrča (смрча)."
  ],
  "laburnum_x_watereri": [
    "Laburnum × watereri (or Laburnum watereri), is a naturally occurring hybrid species of Laburnum, native to Central Europe. Its parents are common laburnum, Laburnum anagyroides, and alpine laburnum, Laburnum alpinum. A small tree or large shrub, it is a popular garden plant, called golden chain tree for its spectacular display of hanging clusters of yellow blossoms. It can be trained to take forms such as arches and espaliers. The best known cultivar is 'Vossii', which has gained the Royal Horticultural Society's Award of Garden Merit. All parts of the plant are poisonous, although mortality is very rare."
  ],
  "alnus_species": [null],
  "cupressocyparis_x_leylandii": [null],
  "pinus_ponderosa": [
    "Pinus ponderosa, commonly known as the ponderosa pine, bull pine, blackjack pine, western yellow-pine, or filipinus pine is a very large pine tree species of variable habitat native to mountainous regions of western North America. It is the most widely distributed pine species in North America."
  ],
  "syringa_vulgaris": [
    "Syringa vulgaris, the lilac or common lilac, is a species of flowering plant in the olive family Oleaceae, native to the Balkan Peninsula, where it grows on rocky hills. Grown for its scented flowers in spring, this large shrub or small tree is widely cultivated and has been naturalized in parts of Europe and North America. It is not regarded as an aggressive species. It is found in the wild in widely scattered sites, usually in the vicinity of past or present human habitations."
  ],
  "acer_pennsylvanicum": [
    "Acer pensylvanicum known as the striped maple, moosewood, moose maple or goosefoot maple, is a small North American species of maple. The striped maple is a sequential hermaphrodite, meaning that it can change its sex throughout its lifetime.",
    "The natural range of the striped maple extends from Nova Scotia and the Gaspe Peninsula of Quebec, west to southern Ontario, Michigan, and Saskatchewan; south to northeastern Ohio, Pennsylvania, and New Jersey, and along the Appalachian Mountains as far south as northern Georgia."
  ],
  "magnolia_x_soulangeana": [
    "Magnolia × soulangeana, the saucer magnolia, is a hybrid plant in the genus Magnolia and family Magnoliaceae. It is a deciduous tree with large, early-blooming flowers in various shades of white, pink, and purple. It is one of the most commonly used magnolias in horticulture, being widely planted in the British Isles, especially in the south of England; and in the United States, especially the east and west coasts."
  ],
  "picea_engelmannii": [
    "Picea engelmannii, with common names Engelmann spruce, white spruce, mountain spruce, or silver spruce, is a species of spruce native to western North America, from central British Columbia and southwest Alberta, southwest to northern California and southeast to Arizona and New Mexico; there are also two isolated populations in northern Mexico. It is mostly a high altitude mountain tree, growing at 900 metres (3,000 ft) – 3,650 metres (11,980 ft) altitude, rarely lower in the northwest of the range; in many areas it reaches the alpine tree line."
  ],
  "magnolia_species": [null],
  "salix_alba": [
    "Salix alba, the white willow, is a species of willow native to Europe and western and central Asia. The name derives from the white tone to the undersides of the leaves."
  ],
  "celtis_occidentalis": [
    "Celtis occidentalis, commonly known as the common hackberry, is a large deciduous tree native to North America. It is also known as the nettletree, sugarberry, beaverwood, northern hackberry, and American hackberry. It is a moderately long-lived hardwood with a light-colored wood, yellowish gray to light brown with yellow streaks."
  ],
  "liriodendron_chinense": [
    "Liriodendron chinense is Asia's native species in the genus Liriodendron. This native of central and southern China grows in the provinces of Anhui, Guangxi, Jiangsu, Fujian, Guizhou, Hubei, Hunan, Jiangxi, Shaanxi, Zhejiang, Sichuan and Yunnan, and also locally in northern Vietnam. Protected populations occur in the Tianmushan National Reserve, Huangshan, Wuyi Shan, and Badagongshan Nature Reserve."
  ],
  "prunus_padus": [
    "Prunus padus, known as bird cherry, hackberry, hagberry, or Mayday tree, is a flowering plant in the rose family Rosaceae. It is a species of cherry, a deciduous small tree or large shrub up to 16 m tall. It is the type species of the subgenus Padus, which have flowers in racemes. It is native to northern Europe and northern Asia."
  ],
  "paulownia_tomentosa": [
    "Paulownia tomentosa, common names princess tree, empress tree, or foxglove-tree, is a deciduous tree in the family Paulowniaceae, native to central and western China. It is an extremely fast-growing tree with seeds that disperse readily, and is a persistent exotic introduced species in North America, where it has undergone naturalisation in large areas of the Eastern US. P. tomentosa has also been introduced to Western and Central Europe, and is establishing itself as a naturalised species there as well."
  ],
  "acer_tataricum": [
    "Acer tataricum, the Tatar maple or Tatarian maple, is a species of maple widespread across central and southeastern Europe and temperate Asia, from Austria and Turkey east as far as Japan and the Russian Far East. The species is named after the Tatar peoples of southern Russia; the tree's name is similarly commonly also spelled \"Tartar\" in English."
  ],
  "prunus_simonii": [
    "Prunus simonii, called apricot plum and Simon plum, is a tree in the genus Prunus. It was first described by Elie-Abel Carrière in 1872 and is native to Hebei province, China.\nThe species is not known in a truly wild state.\nIt has been important for breeding commercial plum cultivars from crosses with other species of the genus Prunus.\nThe species is named for Gabriel Eugène Simon (1829–1896), a French botanist and diplomat who sent pits to the Paris Museum in the early 1860s while he was representing the French government in China.\nBeginning about 1881, the species became commonly known in the United States; having been introduced there from France."
  ],
  "ulmus_species": [
    "Elms are deciduous and semi-deciduous trees comprising the flowering plant genus Ulmus in the plant family Ulmaceae. The genus first appeared in the Miocene geological period about 20 million years ago, originating in what is now central Asia. These trees flourished and spread over most of the Northern Hemisphere, inhabiting the temperate and tropical-montane regions of North America and Eurasia, presently ranging southward in the Middle East to Lebanon, and Israel, and across the Equator in the Far East into Indonesia."
  ],
  "pinus_monticola": [
    "Western white pine also called silver pine, and California mountain pine, in the family Pinaceae, is a species of pine that occurs in the mountains of the western United States and Canada, specifically the Sierra Nevada, the Cascade Range, the Coast Range, and the northern Rocky Mountains. The tree extends down to sea level in many areas, particularly in Oregon and Washington. It is the state tree of Idaho, and is sometimes known as the Idaho pine."
  ],
  "rhus_species": [null],
  "betula_populifolia": [
    "Betula populifolia is a deciduous tree native to eastern North America."
  ],
  "populus_tremuloides": [
    "Populus tremuloides is a deciduous tree native to cooler areas of North America, one of several species referred to by the common name aspen. It is commonly called quaking aspen, trembling aspen, American aspen, mountain or golden aspen, trembling poplar, white poplar, and popple, as well as others. The trees have tall trunks, up to 25 meters tall, with smooth pale bark, scarred with black. The glossy green leaves, dull beneath, become golden to yellow, rarely red, in autumn. The species often propagates through its roots to form large clonal groves originating from a shared root system. These roots are not rhizomes, as new growth develops from adventitious buds on the parent root system."
  ],
  "picea_species": [null],
  "juniperus_virginiana": [
    "Juniperus virginiana, also known as red cedar, eastern red cedar, Virginian juniper, eastern juniper, red juniper, and other, local names, is a species of juniper native to eastern North America from southeastern Canada to the Gulf of Mexico and east of the Great Plains. Further west it is replaced by the related Juniperus scopulorum and to the southwest by Juniperus ashei."
  ],
  "acer_cissifolium": [
    "Acer cissifolium is a maple native to Japan, from southern Hokkaidō south through Honshū and Shikoku to Kyūshū."
  ],
  "salix_species": [null],
  "sequoiadendron_giganteum": [
    "Sequoiadendron giganteum is the sole living species in the genus Sequoiadendron, and one of three species of coniferous trees known as redwoods, classified in the family Cupressaceae in the subfamily Sequoioideae, together with Sequoia sempervirens and Metasequoia glyptostroboides. Giant sequoia specimens are the most massive trees on Earth. The common use of the name sequoia usually refers to Sequoiadendron giganteum, which occurs naturally only in groves on the western slopes of the Sierra Nevada Mountains of California."
  ],
  "crataegus_mollis": [
    "Crataegus mollis, known as downy hawthorn or red hawthorn, occurs in eastern North America from southeastern North Dakota east to Nova Scotia and southwest to eastern Texas. The range of this species is from southern Ontario and Michigan to eastern North Dakota and southward to Denison, Texas, and Arizona. This tree inhabits wooded bottomlands, the prairie border, and the midwest savanna understorey."
  ],
  "juglans_cinerea": [
    "Juglans cinerea, commonly known as butternut or white walnut, is a species of walnut native to the eastern United States and southeast Canada."
  ],
  "cladrastis_lutea": [
    "Cladrastis kentukea, the Kentucky yellowwood or American yellowwood, is a species of Cladrastis native to the Southeastern United States, with a restricted range from western North Carolina west to eastern Oklahoma, and from southern Missouri and Indiana south to central Alabama. Also the tree is sometimes called Virgilia."
  ],
  "acer_pseudosieboldianum": [
    "Acer pseudosieboldianum, the Korean maple or purplebloom maple, is a species of maple. It is native to northeastern China, Korea, and the Russian Far East."
  ],
  "larix_decidua": [
    "Larix decidua, the European larch, is a species of larch native to the mountains of central Europe, in the Alps and Carpathian Mountains as well as the Pyrenees, with disjunct lowland populations in northern Poland and southern Lithuania. It is widely naturalized in Scandinavia. Its life span has been confirmed to be close to 1000 years but is more often around 200 years. It is claimed that one of the larches planted by the second Duke of Atholl at Dunkeld in 1738 is still standing."
  ],
  "juglans_ailanthifolia": [
    "Juglans ailantifolia, the Japanese walnut, is a species of walnut native to Japan and Sakhalin. It is a deciduous tree growing to 20 m (66 ft) tall, rarely 30 m (98 ft), and 40–80 cm stem diameter, with light grey bark. The leaves are pinnate, 50–90 cm long, with 11-17 leaflets, each leaflet 7–16 cm long and 3–5 cm broad. The whole leaf is downy-pubescent, and a somewhat brighter, yellower green than many other tree leaves. The male flowers are inconspicuous yellow-green catkins produced in spring at the same time as the new leaves appear. The female flowers have pink/ red pistils. The fruit is a nut, produced in bunches of 4-10 together; the nut is spherical, 3–5 cm long and broad, surrounded by a green husk before maturity in mid autumn."
  ],
  "euonymus_europea": [
    "Euonymus europaeus, the spindle, European spindle, or common spindle, is a species of flowering plant in the family Celastraceae, native to much of Europe, where it inhabits the edges of forest, hedges and gentle slopes, tending to thrive on nutrient-rich, chalky and salt-poor soils. It is a deciduous shrub or small tree. Other names include fusoria, fusanum, ananbeam, shemshad rasmi (Iran), while it may have given its name to the ancient Greek settlement of Euonymeia."
  ],
  "sorbus_alnifolia": [
    "Sorbus alnifolia, also called alder-leafed whitebeam, Korean whitebeam, or Korean mountain ash, Chinese: 水榆花楸; pinyin: shui yu hua qiu; lit. 'water elm rowan', is a species of whitebeam native to eastern Asia in eastern and northern China, Taiwan, Korea and Japan."
  ],
  "malus_pendula": [null],
  "quercus_macrocarpa": [
    "Quercus macrocarpa, the bur oak, commonly spelled burr oak, is a species of oak tree native to eastern North America. It is in the white oak section, Quercus sect. Quercus, and is also called mossycup oak, mossycup white oak, blue oak, or scrub oak. The acorns are the largest of any North American oak, and are important food for wildlife."
  ],
  "corylus_maxima": [
    "Corylus maxima, the filbert, is a species of hazel in the birch family Betulaceae,\nnative to southeastern Europe and southwestern Asia, from the Balkans to Ordu in Turkey."
  ],
  "abies_concolor": [
    "Abies concolor, the white fir, is a coniferous tree in the pine family Pinaceae. This tree is native to the mountains of western North America from the southern Cascade range in Oregon, south throughout California and into the Sierra de San Pedro Mártir in northern Baja California; east through parts of southern Idaho, to Wyoming; and south throughout the Colorado Plateau and southern Rocky Mountains in Utah and Colorado, and into the isolated mountain ranges of southern Arizona, New Mexico and northern Mexico. White fir live over 300 years and naturally occur at an elevation between 900–3,400 m (2,950–11,200 ft)."
  ],
  "calocedrus_decurrens": [
    "Calocedrus decurrens, with the common names incense cedar and California incense-cedar, is a species of conifer native to western North America. It is the most widely known species in the genus, and is often simply called 'incense cedar' without the regional qualifier."
  ],
  "tsuga_mertensiana": [
    "Tsuga mertensiana, known as mountain hemlock, is a species of hemlock native to the west coast of North America, with its northwestern limit on the Kenai Peninsula, Alaska, and its southeastern limit in northern Tulare County, California. Mertensiana refers to Karl Heinrich Mertens (1796–1830), a German botanist who collected the first specimens as a member of a Russian expedition in 1826-1829."
  ],
  "chitalpa_tashkentensis": [
    "× Chitalpa is an intergeneric hybrid flowering tree in the family Bignoniaceae. There are two major forms in North America, the 'Morning Cloud' a hybrid of desert willow for desert hardiness and color, and northern catalpa, and the 'Pink Dawn' variety formed as a hybrid of desert willow and either yellow catalpa or northern catalpa. Both forms were originally thought to be hybrids of Desert Willow and Southern Catalpa. The name is nothogeneric, or a combination of the two parents' names. Leaves are lanceolate, 10 to 13 cm long and 2.5 cm (1 in) wide, almost always in whorls of three. The trumpet-shaped flowers are 2.5 cm (1 in) long and frilly. The inflorescence is indeterminate, with alternately arranged flowers."
  ],
  "koelreuteria_paniculata": [
    "Koelreuteria paniculata is a species of flowering plant in the family Sapindaceae, native to eastern Asia, in China and Korea. It was introduced in Europe in 1747, and to America in 1763, and has become a popular landscape tree worldwide. Common names include goldenrain tree, pride of India, China tree, and the varnish tree."
  ],
  "alnus_rubra": [
    "Alnus rubra, the red alder,\nis a deciduous broadleaf tree native to western North America."
  ],
  "ulmus_carpinifolia": [
    "Ulmus minor Mill., the field elm, is by far the most polymorphic of the European species, although its taxonomy remains a matter of contention. Its natural range is predominantly south European, extending to Asia Minor and Iran; its northern outposts are the Baltic islands of Öland and Gotland, although it may have been introduced here by man. The tree's typical habitat is low-lying forest along the main rivers, growing in association with oak and ash, where it tolerates summer floods as well as droughts."
  ],
  "abies_species": [
    "Firs (Abies) are a genus of 48–56 species of evergreen coniferous trees in the family Pinaceae. They are found through much of North and Central America, Europe, Asia, and North Africa, occurring in mountains over most of the range. Firs are most closely related to the genus Cedrus (cedar). Douglas firs are not true firs, being of the genus Pseudotsuga."
  ],
  "syringa_species": [null],
  "malus_yunnanensis": [
    "Malus yunnanensis is a species in the genus Malus, family Rosaceae, with the common name Yunnan crabapple. In Mandarin Chinese, it is called “滇池海棠”."
  ],
  "acer_glabrum": [
    "Acer glabrum is a species of maple native to western North America, from southeastern Alaska, British Columbia and western Alberta, east to western Nebraska, and south through Washington, Oregon, Idaho, Montana and Colorado to California, Arizona and New Mexico."
  ],
  "morus_alba": [
    "Morus alba, known as white mulberry, common mulberry and silkworm mulberry, is a fast-growing, small to medium-sized mulberry tree which grows to 10–20 m (33–66 ft) tall. It is generally a short-lived tree with a lifespan comparable to that of humans, although there are some specimens known to be more than 250 years old. The species is native to central China and is widely cultivated and naturalized elsewhere."
  ],
  "populus_x_canescens": [
    "Populus × canescens, the grey poplar, is a hybrid between Populus alba and Populus tremula. It is intermediate between its parents, with a thin grey downy coating on the leaves, which are also much less deeply lobed than the leaves of P. alba. It is a very vigorous tree with marked hybrid vigour, reaching 40 m tall and with a trunk diameter over 1.5 m – much larger than either of its parents. Most trees in cultivation are male, but female trees occur naturally and some of these are also propagated."
  ],
  "cornus_species": [
    "Cornus is a genus of about 30–60 species of woody plants in the family Cornaceae, commonly known as dogwoods, which can generally be distinguished by their blossoms, berries, and distinctive bark. Most are deciduous trees or shrubs, but a few species are nearly herbaceous perennial subshrubs, and a few of the woody species are evergreen. Several species have small heads of inconspicuous flowers surrounded by an involucre of large, typically white petal-like bracts, while others have more open clusters of petal-bearing flowers. The various species of dogwood are native throughout much of temperate and boreal Eurasia and North America, with China, Japan, and the southeastern United States being particularly rich in native species."
  ],
  "malus_sargentii": [
    "Malus sargentii, occasionally called Sargent's apple or Sargent crabapple, is a species of crabapple in the genus Malus. The species was formerly considered a variety of the species Malus sieboldii. The plant is a shrub growing about 6 feet tall. Malus sargentii is native to Japan but is commonly used as an ornamental shrub elsewhere."
  ],
  "quercus_x warei": [
    "Quercus × warei is a hybrid oak tree in the genus Quercus. The tree is a hybrid of Quercus robur L. f. fastigiata (Lam.) O. Schwarz and Quercus bicolor Willd. .\nThe hybrid is named for the American dendrologist George Ware, former Research Director at the Morton Arboretum, Illinois."
  ],
  "prunus_maackii": [
    "Prunus maackii, commonly called the Manchurian cherry or Amur chokecherry, is a species of cherry native to Korea and both banks of the Amur River, in Manchuria in northeastern China, and Amur Oblast and Primorye in southeastern Russia. It used to be considered a species of Prunus subg. Padus, but both morphological and molecular studies indicate it belongs to Prunus subg. Cerasus."
  ],
  "cercis_chinensis": [
    "Cercis chinensis, the Chinese redbud, is a plant in the legume the family Fabaceae, native to China."
  ],
  "aesculus_pavia": [
    "Aesculus pavia, known as red buckeye or firecracker plant, is a species of deciduous flowering plant. The small tree or shrub is native to the southern and eastern parts of the United States, found from Illinois to Virginia in the north and from Texas to Florida in the south. It is hardy far to the north of its native range, with successful cultivation poleward to Arboretum Mustila in Finland."
  ],
  "prunus_lusitanica": [
    "Prunus lusitanica, the Portuguese laurel cherry or Portugal laurel, is a species of flowering plant in the rose family Rosaceae, native to southwestern France, Spain, Portugal, Morocco, and Macaronesia."
  ],
  "prunus_serrula": [
    "Prunus serrula, called birch bark cherry, birchbark cherry, paperbark cherry, or Tibetan cherry, is a species of cherry native to China, and is used as an ornamental in many parts of the world for its striking coppery-red bark."
  ],
  "picea_glauca": [
    "Picea glauca, the white spruce, is a species of spruce native to the northern temperate and boreal forests in North America. Picea glauca was originally native from central Alaska all through the east, across southern/central Canada to the Avalon Peninsula in Newfoundland. It now has become naturalized southward into the far northern United States border states like Montana, Minnesota, Wisconsin, Michigan, Vermont, New Hampshire and Maine; there is also an isolated population in the Black Hills of South Dakota and Wyoming. It is also known as Canadian spruce, skunk spruce, cat spruce, Black Hills spruce, western white spruce, Alberta white spruce, and Porsild spruce."
  ],
  "castanea_species": [
    "The chestnuts are a group of eight or nine species of deciduous trees and shrubs in the genus Castanea, in the beech family Fagaceae. They are native to temperate regions of the Northern Hemisphere."
  ],
  "pinus_flexilus": [
    "Pinus flexilis, the limber pine, is a species of pine tree-the family Pinaceae that occurs in the mountains of the Western United States, Mexico, and Canada. It is also called Rocky Mountain white pine."
  ],
  "tilia_tomentosa": [
    "Tilia tomentosa, known as silver linden in the US and silver lime in the UK, is a species of flowering plant in the family Malvaceae, native to southeastern Europe and southwestern Asia, from Romania and the Balkans east to western Turkey, occurring at moderate altitudes."
  ],
  "manglietia_insignis": [
    "Magnolia insignis is an evergreen tree growing to 30 metres in the wild. The fragrant flowers are about 12 centimetres across when fully open, and they are composed of 9 to 12 tepals. The species is sporadically distributed throughout southwestern China, Indochina, and the Himalayas between 900 and 2600 metres; it is, moreover, remarkably cold hardy (to at least Zone 7). [This description courtesy of the UBC Botanical Garden]"
  ],
  "taxodium_distichum": [
    "Taxodium distichum is a deciduous conifer in the family Cupressaceae. It is native to the southeastern United States. Hardy and tough, this tree adapts to a wide range of soil types, whether wet, salty, dry, or swampy. It is noted for the russet-red fall color of its lacy needles."
  ],
  "sophora_japonica": [
    "Styphnolobium japonicum (L.) Schott, the Japanese pagoda tree is a species of tree in the subfamily Faboideae of the pea family Fabaceae."
  ],
  "fraxinus_nigra": [
    "Fraxinus nigra, the black ash, is a species of ash native to much of eastern Canada and the northeastern United States, from western Newfoundland west to southeastern Manitoba, and south to Illinois and northern Virginia. Formerly abundant, as of 2014 the species is threatened with near total extirpation throughout its range, as a result of infestation by a parasitic insect known as the emerald ash borer."
  ],
  "picea_mariana": [
    "Picea mariana, the black spruce, is a North American species of spruce tree in the pine family. It is widespread across Canada, found in all 10 provinces and all 3 territories. It is the official tree of the province of Newfoundland and Labrador and is that province's most numerous tree. The range of the black spruce extends into northern parts of the United States: in Alaska, the Great Lakes region, and the upper Northeast. It is a frequent part of the biome known as taiga or boreal forest."
  ],
  "hippophae_rhamnoides": [
    "Hippophae rhamnoides, also known as sea-buckthorn, is a species of flowering plant in the family Elaeagnaceae, native to the cold-temperate regions of Europe and Asia. It is a spiny deciduous shrub. The plant is used in the food and cosmetics industries, in traditional medicine, as animal fodder, in horticulture, and for ecological purposes."
  ],
  "prunus_pennsylvanica": [
    "Prunus pensylvanica, also known as bird cherry, fire cherry, pin cherry, and red cherry, is a North American cherry species in the genus Prunus."
  ],
  "taxodium_ascendens": [
    "Taxodium ascendens, also known as pond cypress, is a deciduous conifer of the genus Taxodium, native to North America. Many botanists treat it as a variety of bald cypress, Taxodium distichum rather than as a distinct species, but it differs in habitat, occurring mainly in still blackwater rivers, ponds and swamps without silt-rich flood deposits. It predominates in cypress dome habitats."
  ],
  "pinus_banksiana": [
    "Jack pine is an eastern North American pine. Its native range in Canada is east of the Rocky Mountains from the Mackenzie River in the Northwest Territories to Cape Breton Island in Nova Scotia, and the north-central and northeast of the United States from Minnesota to Maine, with the southernmost part of the range just into northwest Indiana and northwest Pennsylvania. It is also known as grey pine and scrub pine."
  ],
  "betula_alba-sinensis": [
    "Betula albosinensis, the Chinese red birch, syn. B. bhojpattra var. sinensis, B. utilis var. sinensis, is a species of birch in the family Betulaceae, native to Western China. It is a deciduous tree growing to 25 metres (82 ft). A particular feature is the peeling brown bark (cream when newly exposed). In fact the Latin specific name albosinensis means \"white, from China\". Brown catkins are produced in Spring."
  ],
  "quercus_prinus": [
    "Quercus montana, the chestnut oak, is a species of oak in the white oak group, Quercus sect. Quercus. It is native to the eastern United States, where it is one of the most important ridgetop trees from southern Maine southwest to central Mississippi, with an outlying northwestern population in southern Michigan. It is also sometimes called rock oak because of its presence in montane and other rocky habitats. As a consequence of its dry habitat and ridgetop exposure, it is not usually a large tree, typically 18–22 m (59–72 ft) tall; occasional specimens growing in better conditions can however become large, with trees up to 40–43 m (131–141 ft) tall known. They tend to have a similar spread of 18–22 m (59–72 ft). A 10-year-old sapling grown in full sun will stand about 5 m (16 ft) tall. This species is often an important canopy species in an oak-heath forest."
  ],
  "prunus_triloba": [
    "Prunus triloba, sometimes called flowering plum or flowering almond, a name shared with Prunus jacquemontii, is a shrubby cherry, sometimes becoming a small tree. The flowers are pale pink or white, and the fruit are red and \"pubescent\", i.e. with soft hair. It originates from China but is popular around the world as an ornamental."
  ],
  "magnolia_grandiflora": [
    "Magnolia grandiflora, commonly known as the southern magnolia or bull bay, is a tree of the family Magnoliaceae native to the southeastern United States, from Virginia to central Florida, and west to East Texas. Reaching 27.5 m (90 ft) in height, it is a large, striking evergreen tree, with large dark green leaves up to 20 cm long and 12 cm wide, and large, white, fragrant flowers up to 30 cm (12 in) in diameter."
  ],
  "magnolia_officinalis": [
    "Magnolia officinalis is a species of Magnolia native to the mountains and valleys of China at altitudes of 300–1500 m."
  ],
  "sorbus_species": [null],
  "corylus_colurna": [
    "Corylus colurna, the Turkish hazel or Turkish filbert, is a deciduous tree native to southeast Europe and southwest Asia, from the Balkans through northern Turkey to northern Iran. It is also found grown wildly in the forests of Western Himalayan range in the north Indian state of Himachal Pradesh particularly in the temperate regions of districts of Kullu, Shimla, Kinnaur district and Chamba district."
  ],
  "fagus_grandifolia": [
    "Fagus grandifolia, the American beech or North American beech, is the species of beech tree native to the eastern United States and extreme southeast Canada."
  ],
  "quercus_species": [
    "The genus Quercus (oak) contains over 500 species, some of which are listed here."
  ],
  "clerodendron_trichotomum": [null],
  "crataegus_crus-galli": [
    "Crataegus crus-galli is a species of hawthorn known by the common names cockspur hawthorn and cockspur thorn. It is native to eastern North America from Ontario to Texas to Florida, and it is widely used in horticulture. It is thought to be the parent, along with Crataegus succulenta, of the tetraploid species Crataegus persimilis."
  ],
  "quercus_myrsinifolia": [
    "Quercus myrsinifolia is an Asian species of tree in the ring-cupped oaks subgenus of the family Fagaceae. It has several common names, including bamboo-leaf oak, Chinese evergreen oak, and Chinese ring-cupped oak. Its Chinese name is 小叶青冈; pinyin: xiǎo yè qīng gāng, which means little leaf ring-cupped oak, in Japan it is called white oak  and in Korea it is known as gasinamu (가시나무). It is native to east central and southeast China, Japan, Korea, Laos, northern Thailand, and Vietnam."
  ],
  "salix_matsudana": [
    "Salix babylonica is a species of willow native to dry areas of northern China, but cultivated for millennia elsewhere in Asia, being traded along the Silk Road to southwest Asia and Europe."
  ],
  "thuja_orientalis": [
    "Platycladus is a monotypic genus of evergreen coniferous trees in the cypress family Cupressaceae, containing only one species, Platycladus orientalis, also known as Chinese thuja, Oriental arborvitae, Chinese arborvitae, biota or Oriental thuja. It is native to northeastern parts of East Asia and North Asia, but is also now naturalised as an introduced species in other regions of the Asian continent."
  ],
  "laurus_nobilis": [
    "Laurus nobilis is an aromatic evergreen tree or large shrub with green, glabrous smooth leaves, in the flowering plant family Lauraceae. It is native to the Mediterranean region and is used as bay leaf for seasoning in cooking. Its common names include bay tree, bay laurel, sweet bay, true laurel, Grecian laurel, or simply laurel. Laurus nobilis figures prominently in classical Greco-Roman culture."
  ],
  "ficus_species": [null],
  "ulmus_x_hollandica": [
    "Ulmus × hollandica Mill. , often known simply as Dutch elm, is a natural hybrid between Wych elm Ulmus glabra and field elm Ulmus minor which commonly occurs across Europe wherever the ranges of the parent species overlap. In England, according to the field-studies of R. H. Richens, \"The largest area [of hybridization] is a band extending across Essex from the Hertfordshire border to southern Suffolk. The next largest is in northern Bedfordshire and adjoining parts of Northamptonshire. Comparable zones occur in Picardy and Cotentin in northern France\"."
  ],
  "phellodendon_amurense": [
    "Phellodendron amurense, commonly called Amur cork tree, is a deciduous tree with a rounded, broad-spreading crown. It is noted for its attractive shape, bark and foliage. It is indigenous to moist soils in the valley of the Amur River which serves as the boundary between Siberia and China. It typically grows 30-45’ tall with a short trunk and low horizontal branching. Some mature specimens at the Missouri Botanical Garden have very large lower branches that gracefully dip to touch the ground many feet from the trunk. Grayish-brown bark on mature trees is ridged and corky. Compound, odd-pinnate, yellowish green to green leaves have 5-11 leaflets (each leaflet to 4 1/2” long). Foliage turns an undistinguished yellow in fall. This species is dioecious (separate male and female trees). Non-showy, yellowish green flowers appear in panicles in May-June. Pollinated flowers on female trees give way to fleshy pea-sized fruits (1/2” diameter drupes) which mature to black in fall (October) and persist well into winter. Foliage and fruits are unpleasantly aromatic when bruised, which is somewhat characteristic of the Rue family to which this stately tree belongs."
  ],
  "rhamnus_purshiana": [
    "Frangula purshiana is a species of plant in the family Rhamnaceae. It is native to western North America from southern British Columbia south to central California, and eastward to northwestern Montana."
  ],
  "aesculus_glabra": [
    "Aesculus glabra, commonly known as Ohio buckeye, is a species of tree in the soapberry family (Sapindaceae) native to North America."
  ],
  "acer_barbatum": [
    "Acer barbatum is a confused scientific name for a North American maple.A plant originally described by André Michaux in 1803, a synonym of Acer saccharum\nA plant originally described by William Jackson Hooker in 1831, a synonym of Acer glabrum\nA plant so named in some recent texts, a synonym of Acer floridanum\n"
  ],
  "acer_nigrum": [
    "Acer nigrum is a species of maple closely related to A. saccharum, and treated by some authors as a subspecies of it, as Acer saccharum subsp. nigrum."
  ],
  "picea_likiangensis": [
    "Picea likiangensis is a species of spruce found in Bhutan and China. Its population has been reduced by 30% in 75 years by logging, and the species is therefore categorised as vulnerable by the IUCN."
  ],
  "magnolia_x_loebneri": [
    "This deciduous Magnolia tree is a hybrid from a cross between Magnolia ''kobus' and Magnolia 'stellata'. The Loebner Magnolia is vigorous and flowers at an early age. It is a smaller magnolia at 20 to 30 feet, about as wide, and has a round shape. White blooms appear in February to March. This tree is sometimes grown in a multi-trunked shrub form.",
    "A number of hybrid cultivars, or varieties, are now available commercially, featuring flowers that have white or varying shades of pink, including pink-lilac.",
    "An interesting feature is that a bruised stem emits a sweet fragrance. As with other Magnolias, wildlife may use it as cover both within the dense branches and underneath on the ground. It can be grown in full sun or at the edge of a woodland area with partial shade."
  ],
  "pinus_parviflora": [
    "Pinus parviflora, also known as five-needle pine, Ulleungdo white pine, or Japanese white pine, is a pine in the white pine group, Pinus subgenus Strobus, native to Korea and Japan."
  ],
  "amelanchier_canadensis": [
    "Amelanchier canadensis is a species of Amelanchier native to eastern North America in Canada from Newfoundland west to southern Ontario, and in the United States from Maine south to Alabama. It is largely restricted to wet sites, particularly on the Atlantic coastal plain, growing at altitudes from sea level up to 200 m."
  ],
  "quercus_robur_x_alba": [null],
  "ficus_carica": [
    "Ficus carica is an Asian species of flowering plant in the mulberry family, known as the common fig. The fruit, also called the fig, is an important crop in those areas where it is grown commercially. Native to the Mediterranean and western Asia, it has been sought out and cultivated since ancient times and is now widely grown throughout the world, both for its fruit and as an ornamental plant. The species has become naturalized in scattered locations in Asia and North America."
  ],
  "stewartia_monadelpha": [null],
  "amelanchier_alba": [null],
  "quercus_shumardii": [
    "Quercus shumardii, the Shumard oak, spotted oak, Schneck oak, Shumard red oak, or swamp red oak, is one of the largest of the oak species in the red oak group. It is closely related to Quercus buckleyi, Quercus texana, and Quercus gravesii."
  ],
  "quercus_frainetto": [
    "Quercus frainetto, commonly known as the Hungarian oak or Italian oak, is a species of oak, native to southeastern Europe and Turkey; it is classified in Quercus sect. Mesobalanus."
  ],
  "laburnum_species": [null],
  "quercus_x_bimundorum": [null],
  "pinus_mugo": [
    "Pinus mugo, known as bog pine, creeping pine, dwarf mountain pine, mugo pine, mountain pine, scrub mountain pine, or Swiss mountain pine, is a species of conifer, native to high elevation habitats from southwestern to Central Europe and Southeast Europe."
  ],
  "mespilus_germanica": [
    "Mespilus germanica, known as the medlar or common medlar, is a large shrub or small tree in the rose family Rosaceae. The fruit of this tree is also called the medlar. The fruit has been cultivated since Roman times, and is unusual in being available in winter, and in being eaten when bletted. It is eaten raw and in a range of dishes. When the genus Mespilus is included in the genus Crataegus, the correct name for this species is Crataegus germanica (Kuntze). In the southwest of England it historically had a number of vulgar nicknames, such as open-arse and monkey's bottom, due to the appearance of its large calyx."
  ],
  "cornus_officianalis": [
    "Cornus officinalis, the Japanese cornel or Japanese cornelian cherry, is a species of flowering plant in the dogwood family Cornaceae. Despite its name it is native to China and Korea as well as Japan. It is not to be confused with C. mas, which is also known as the Cornelian cherry. It is not closely related to the true cherries of the genus Prunus.",
    "It is a small deciduous understory tree growing to 18 m (59 ft) tall and 20–50 centimetres (8–20 in) trunk diameter. The bark is brown to gray-brown, with narrow shaggy plates flaking off, while younger twigs and branches are smoother and gray, with small lenticels.[5][7] Very young twigs are sparsely fuzzy to thickly hairy; the hairs (trichomes) drop off by the next year."
  ],
  "arbutus_menziesii": [
    "Arbutus menziesii, the Pacific madrone or madrona, is a species of deciduous evergreen tree in the family Ericaceae, native to the western coastal areas of North America, from British Columbia to California."
  ],
  "acer_miyabei": [
    "Acer miyabei is a species of maple native to Japan, where it occurs in Hokkaidō and the Tōhoku region in northern Honshū."
  ],
  "prunus_cocomilia": [
    "Prunus cocomilia is a species of plum commonly called Italian plum. It is native to Albania, Croatia, Greece, southern Italy, Montenegro, North Macedonia, Serbia, and western Turkey."
  ],
  "acer_argutum": [
    "Acer argutum, commonly known in English as pointed-leaf maple and in Japanese as asanoha-kaede, is a species of deciduous flowering tree native to Japan. It is a member of the genus Acer, in the family Sapindaceae. It has an upright growth habit and can reach heights of 10 m (33 ft) tall."
  ],
  "oxydendrum_arboreum": [
    "Oxydendrum arboreum, the sourwood or sorrel tree, is the sole species in the genus Oxydendrum, in the family Ericaceae. It is native to eastern North America, from southern Pennsylvania south to northwest Florida and west to southern Illinois; it is most common in the lower chain of the Appalachian Mountains. The tree is frequently seen as a component of oak-heath forests."
  ],
  "aralia_elata": [
    "Aralia elata, the Japanese angelica tree, Chinese angelica-tree, or Korean angelica-tree, is a woody plant belonging to the family Araliaceae. It is known as tara-no-ki in Japanese, and dureup-namu (두릅나무) in Korean."
  ],
  "abies_koreana": [
    "Abies koreana, the Korean fir, is a species of fir native to the higher mountains of South Korea, including Jeju Island. It grows at altitudes of 1,000–1,900 metres (3,300–6,200 ft) in temperate rainforest with high rainfall and cool, humid summers, and heavy winter snowfall."
  ],
  "pterostyrax_hispida": [
    "Pterostyrax hispidus, the epaulette tree or fragrant epaulette tree, is a species of flowering plant in the family Styracaceae, native to China and Japan. Growing to 15 m (49 ft) tall by 12 m (39 ft) broad, it is a substantial, spreading, deciduous shrub with oval leaves up to 20 cm (8 in) long, and clusters of pure white, fragrant, pendent flowers in summer."
  ],
  "amelanchier_laevis": [
    "Amelanchier laevis, the smooth shadbush, smooth serviceberry or Allegheny serviceberry, is a North American species of tree in the rose family Rosaceae, growing up to 9 metres (30 ft) tall. It is native to eastern Canada and the eastern United States, from Newfoundland west to Ontario, Minnesota, and Iowa, south as far as Georgia and Alabama."
  ],
  "sorbus_x_thuringiaca": [null],
  "ostryia_virginiana": [
    "Ostrya virginiana, commonly called American hop hornbeam, is a deciduous, Missouri native tree which usually occurs in dry soils on rocky slopes, upland woods and bluffs throughout the State. A small to medium-sized, understory tree with a generally rounded crown. Typically grows 25-40' tall with a slightly smaller spread. Features birch-like, oval to lance-shaped, sharply-serrated, dark yellowish-green leaves (to 5\" long). Leaves turn an undistinguished yellow in autumn and often drop early. Flowers are monoecious (reddish-brown male flowers and greenish female flowers appear in separate catkins on the same tree). Flowers are not particularly showy, although the male catkins are more prominent and are present throughout winter. Female catkins are followed by drooping clusters of sac-like, seed-bearing pods which, as the common name suggests, somewhat resemble the fruit of hops. Also commonly called ironwood because of its extremely hard and dense wood."
  ],
  "catalpa_bungei": [
    "Catalpa bungei, commonly known as Manchurian catalpa, is a species of catalpa native to China. The specific epithet honors the botanist Alexander Bunge, who collected the specimens that Carl Anton von Meyer later described. The flowers are arranged in a corymb and are densely spotted with pink. It is cultivated in China, along with C. ovata, for its wood, which is also used for coffins, ancestral tablets, and oars. It also used as an ornamental tree."
  ],
  "sorbus_tianshanica": [null],
  "malus_x_micromalus": [null],
  "magnolia_virginiana": [
    "Magnolia virginiana, most commonly known as sweetbay magnolia, or merely sweetbay, is a member of the magnolia family, Magnoliaceae. It was the first magnolia to be scientifically described under modern rules of botanical nomenclature, and is the type species of the genus Magnolia; as Magnolia is also the type genus of all flowering plants (magnoliophytes), this species in a sense typifies all flowering plants."
  ],
  "magnolia_cylindrica": [
    "Magnolia cylindrica, the Huangshan magnolia, is a species of plant in the family Magnoliaceae. It is endemic to China. It is threatened by habitat loss."
  ],
  "laburnum_alpinum": [
    "Laburnum alpinum, the Scotch laburnum, Scottish laburnum or alpine laburnum, is a leguminous, (Leguminosae), deciduous tree."
  ],
  "castanea_dentata": [
    "The American chestnut is a large deciduous tree of the beech family native to eastern North America. The American chestnut was one of the most important forest trees throughout its range and was considered the finest chestnut tree in the world."
  ],
  "cryptomeria_japonica": [
    "Cryptomeria is a monotypic genus of conifer in the cypress family Cupressaceae, formerly belonging to the family Taxodiaceae. It includes only one species, Cryptomeria japonica. It used to be considered by some to be endemic to Japan, where it is known as Sugi . The tree is called Japanese cedar or Japanese redwood in English. It has been extensively introduced and cultivated for wood production on the Azores."
  ],
  "corylus_avellana": [
    "Corylus avellana, the common hazel, is a species of hazel native to Europe and western Asia, from the British Isles south to Iberia, Greece, Turkey and Cyprus, north to central Scandinavia, and east to the central Ural Mountains, the Caucasus, and northwestern Iran. It is an important component of the hedgerows that were the traditional field boundaries in lowland England. The wood was traditionally grown as coppice, the poles cut being used for wattle-and-daub building and agricultural fencing."
  ],
  "prunus_emarginata": [
    "Prunus emarginata, the bitter cherry or Oregon cherry, is a species of Prunus native to western North America, from British Columbia south to Baja California, and east as far as western Wyoming and New Mexico. It is often found in recently disturbed areas or open woods on nutrient-rich soil."
  ],
  "stewartia_koreana": [
    "Stewartia pseudocamellia, also known as Korean stewartia, Japanese stewartia, or deciduous camellia, is a \nspecies of flowering plant in the family Theaceae, native to Japan and Korea."
  ],
  "betula_jacquemontii": [
    "Betula utilis, the Himalayan birch, is a deciduous tree native to the Western Himalayas, growing at elevations up to 4,500 m (14,800 ft). The Latin specific epithet utilis means \"useful\", and refers to the many uses of the different parts of the tree. The white, paper-like bark was used in ancient times for writing Sanskrit scriptures and texts. It is still used as paper for the writing of sacred mantras, with the bark placed in an amulet and worn for protection. Selected varieties are used for landscaping throughout the world, even while some areas of its native habitat are being lost due to overuse of the tree for firewood."
  ],
  "michelia_wilsonii": [
    "Magnolia ernestii, the yellow lily-tree, is a species of plant in the family Magnoliaceae. It is endemic to China. It is threatened by habitat loss."
  ],
  "albizia_julibrissin": [
    "Albizia julibrissin, the Persian silk tree or pink silk tree, is a species of tree in the family Fabaceae, native to southwestern and eastern Asia."
  ],
  "prunus_sweetheart": [null],
  "eucommia_ulmoides": [
    "Eucommia ulmoides is a species of small tree native to China. It belongs to the monotypic family Eucommiaceae. It is considered vulnerable in the wild, but is widely cultivated in China for its bark and is highly valued in herbology such as traditional Chinese medicine."
  ],
  "aesculus_flava": [
    "Aesculus flava, the yellow buckeye, common buckeye, or sweet buckeye, is a species of deciduous tree. It is native to the Ohio Valley and Appalachian Mountains of the Eastern United States. It grows in mesophytic forest or floodplains, generally in acid to circumneutral soil, reaching a height of 20m to 48m."
  ],
  "malus_domestica": [
    "An apple is an edible fruit produced by an apple tree. Apple trees are cultivated worldwide and are the most widely grown species in the genus Malus. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today. Apples have been grown for thousands of years in Asia and Europe and were brought to North America by European colonists. Apples have religious and mythological significance in many cultures, including Norse, Greek, and European Christian tradition."
  ],
  "betula_platyphylla": [
    "Betula platyphylla, the Japanese white birch or Siberian silver birch, is a tree species belonging to the genus Betula. It can be found in temperate or subarctic places of Asia: Japan, China, Korea and Siberia. The Japanese White Birch can grow to be 20 m to 30 m tall."
  ],
  "halesia_monticola": [
    "Halesia monticola, the mountain silverbell, is a species of flowering plant in the small family Styracaceae. This large deciduous shrub was originally included in H. carolina, but was identified first as a subspecies by Rehder in 1914, then as a species by Sargent in 1921. More recently, some authoritative sources regard it only as a subspecies or variety, while other authoritative sources regard it as a species, as it is treated here."
  ],
  "juniperus_species": [null],
  "fraxinus_quadrangulata": [
    "Fraxinus quadrangulata, the blue ash, is a species of ash native primarily to the Midwestern United States from Oklahoma to Michigan, as well as the Bluegrass region of Kentucky and the Nashville Basin region of Tennessee. Isolated populations exist in Alabama, Southern Ontario, and small sections of the Appalachian Mountains. It is typically found over calcareous substrates such as limestone, growing on limestone slopes and in moist valley soils, at elevations of 120–600 m."
  ],
  "catalpa_erubescens": [
    "Catalpa × erubescens, the hybrid catalpa, is a hybrid plant species of Catalpa in the family Bignoniaceae. It is a medium sized tree, reaching at most 20 m. Its parents are southern catalpa, Catalpa bignonioides, from the United States, and yellow catalpa, C. ovata, from China. There is one accepted form, Catalpa × erubescens Carrière f. purpurea Paclt, which has purple, some say chocolate-colored, young leaves which turn green as they mature. This form is marketed under a variety of names, such as hybrid catalpa 'Purpurea', red-leaved indian bean tree, and purple hybrid catalpa, and has gained the Royal Horticultural Society's Award of Garden Merit."
  ],
  "malus_spectabilis": [
    "Malus spectabilis is a species of crabapple known by the common names Asiatic apple, Chinese crab, and Chinese flowering apple."
  ],
  "sciadopitys_verticillata": [
    "Sciadopitys verticillata, the kōyamaki or Japanese umbrella-pine, is a unique conifer endemic to Japan. It is the sole member of the family Sciadopityaceae and genus Sciadopitys, a living fossil with no close relatives, and present in the fossil record for about 230 million years."
  ],
  "magnolia_acuminata": [
    "Magnolia acuminata, commonly called the cucumber tree, cucumber magnolia or blue magnolia, is one of the largest magnolias, and one of the cold-hardiest. It is a large forest tree of the Eastern United States and Southern Ontario in Canada. It is a tree that tends to occur singly as scattered specimens, rather than in groves."
  ],
  "ailanthus_altissima": [
    "Ailanthus altissima, commonly known as tree of heaven, ailanthus, varnish tree, or in Chinese as chouchun, is a deciduous tree in the family Simaroubaceae. It is native to northeast and central China, and Taiwan. Unlike other members of the genus Ailanthus, it is found in temperate climates rather than the tropics."
  ],
  "magnolia_x_veitchii": [null],
  "pterocarya_stenoptera": [
    "Pterocarya stenoptera is a small-winged wingnut tree of the Juglandaceae family. It is originally from Southeast China."
  ],
  "sequoia_semprevirens": [
    "Sequoia sempervirens is the sole living species of the genus Sequoia in the cypress family Cupressaceae (formerly treated in Taxodiaceae). Common names include coast redwood, coastal redwood and California redwood. It is an evergreen, long-lived, monoecious tree living 1,200–2,200 years or more. This species includes the tallest living trees on Earth, reaching up to 115.5 meters (379 ft) in height (without the roots) and up to 8.9 meters (29.2 ft) in diameter at breast height (dbh). These trees are also among the oldest living things on Earth. Before commercial logging and clearing began by the 1850s, this massive tree occurred naturally in an estimated 810,000 hectares (2,000,000 acres) along much of coastal California (excluding southern California where rainfall is not sufficient) and the southwestern corner of coastal Oregon within the United States."
  ],
  "quercus_xx": [null],
  "pterocarya_fraxinifolia": [
    "Pterocarya fraxinifolia is a species of tree in the Juglandaceae family. It is commonly known as the Caucasian wingnut or Caucasian walnut. It is native to the Caucasian region Armenia, Azerbaijan, Georgia, Iran, Russia, Ukraine and Turkey. It was introduced to France in 1784, and to Great Britain after 1800."
  ],
  "platanus_orientalis": [
    "Platanus orientalis, the Old World sycamore or Oriental plane, is a large, deciduous tree of the Platanaceae family, growing to 30 m (98 ft) or more, and known for its longevity and spreading crown. In Autumn its deep green leaves may change to blood red, amber, and yellow."
  ],
  "ptelea_trifoliata": [
    "Ptelea trifoliata, commonly known as common hoptree, wafer ash, stinking ash, and skunk bush, is a species of flowering plant in the citrus family (Rutaceae). It is native to North America, where it is found in Canada, Mexico, and the United States. It is a deciduous shrub or tree, with alternate, trifoliate leaves."
  ],
  "quercus_garryana": [
    "Quercus garryana is an oak tree species of the Pacific Northwest, with a range stretching from southern California to southwestern British Columbia. It is commonly known as the Oregon white oak or Oregon oak in the United States and as the Garry oak in Canada. It grows from sea level to 210 meters (690 ft) altitude in the northern part of its range, and at 300 to 1,800 meters in the south of the range in California. The eponymous Nicholas Garry was deputy governor of the Hudson's Bay Company, 1822–35."
  ],
  "malus_transitoria": [
    "Malus transitoria, the cut-leaf crabapple, is a species of flowering plant in the crabapple genus Malus of the family Rosaceae, native to China."
  ],
  "pinus_strobus": [
    "Pinus strobus, commonly denominated the eastern white pine, northern white pine, white pine, Weymouth pine (British), and soft pine is a large pine native to eastern North America. It occurs from Newfoundland, Canada west through the Great Lakes region to southeastern Manitoba and Minnesota, United States, and south along the Appalachian Mountains and upper Piedmont to northernmost Georgia and perhaps very rarely in some of the higher elevations in northeastern Alabama. It is considered rare in Indiana."
  ],
  "cornus_racemosa": [
    "Cornus racemosa, the northern swamp dogwood, gray dogwood or panicle dogwood, is a shrubby plant native to southeastern Canada and the northeastern United States. It is a member of the dogwood genus Cornus and the family Cornaceae."
  ],
  "malus_hupehensis": [
    "Malus hupehensis, common names Chinese crab apple, Hupeh crab or tea crabapple, is a species of flowering plant in the apple genus Malus of the family Rosaceae."
  ],
  "populus_tremula": [
    "Populus tremula, commonly called aspen, common aspen, Eurasian aspen, European aspen, or quaking aspen, is a species of poplar native to cool temperate regions of Europe and Asia, from Iceland and the British Isles east to Kamchatka, north to inside the Arctic Circle in Scandinavia and northern Russia, and south to central Spain, Turkey, the Tian Shan, North Korea, and northern Japan. It also occurs at one site in northwest Africa in Algeria. In the south of its range, it occurs at high altitudes in mountains."
  ],
  "nyssa_sinensis": [
    "Nyssa sinensis is a species of flowering plant in the family Cornaceae, native to China and Vietnam. Growing to 10 m (33 ft) tall and wide, it is a broadly conical deciduous tree, with oval leaves 15–20 cm (6–8 in) long, which turn brilliant red, orange and yellow in autumn."
  ],
  "ilex_meserveae": [
    "Ilex meserveae, commonly known as the Meserveae Holly, is a hybrid evergreen shrub that grows up to 6'6\". The foliage of this plant is remarkably similar to that of Ilex Xxaquipernyi, but the more numerous spines are flexible and almost rubbery, and leaves are not convex. The purplish twigs of Meserveae Holly also serve to distinguish between the two. This plant performs better in northern states than in southern states. This plant is tolerant of the cold and is a rapid grower."
  ],
  "catalpa_ovata": [
    "Catalpa ovata, the yellow catalpa or Chinese catalpa, is a pod-bearing tree native to China. Compared to C. speciosa, it is much smaller, typically reaching heights between 20 and 30 feet. The inflorescences form 4–10-inch-long (100–250 mm) bunches of creamy white flowers with distinctly yellow tinging; individual flowers are about 1 inch (25 mm) wide. They bloom in July and August. The leaves are very similar in shape to those of Paulownia tomentosa, having three lobes, and are darkly green. Fruits are very narrow, foot-long pods."
  ],
  "pinus_jeffreyi": [
    "Pinus jeffreyi, also known as Jeffrey pine, Jeffrey's pine, yellow pine and black pine, is a North American pine tree. It is mainly found in California, but also in the westernmost part of Nevada, southwestern Oregon, and northern Baja California. It is named in honor of its botanist documenter John Jeffrey."
  ],
  "pinus_thunbergii": [
    "Pinus thunbergii, also called black pine, Japanese black pine, and Japanese pine, is an East Asian pine native to coastal areas of Japan and South Korea."
  ],
  "populus_xx": [null],
  "acer_henryi": [
    "Acer henryi is an Asian species of maple. It has been found only in China."
  ],
  "stump_species": [null],
  "pyrus_communis": [
    "Pyrus communis, known as the European pear or common pear, is a species of pear native to central and eastern Europe and southwest Asia."
  ],
  "viburnum_lentago": [
    "Viburnum lentago, the nannyberry, sheepberry, or sweet viburnum, is a species of Viburnum native to North America."
  ],
  "magnolia_stellata": [
    "Magnolia stellata, sometimes called the star magnolia, is a slow-growing shrub or small tree native to Japan. It bears large, showy white or pink flowers in early spring, before its leaves open. This species is closely related to the Kobushi magnolia, and is treated by many botanists as a variety or even a cultivar of that. However, Magnolia stellata was accepted as a distinct species in the 1998 monograph by Hunt."
  ],
  "acer_capillipes": [
    "Acer capillipes, is a maple in the same taxonomic section as other snakebark maples such as A. pensylvanicum, A. davidii and A. rufinerve. It is native to mountainous regions in Japan, on central and southern Honshū, Kyūshū and Shikoku islands, usually growing alongside mountain streams."
  ],
  "abies_procera": [
    "Abies procera, the noble fir, also called red fir and Christmas tree, is a western North American fir, native to the Cascade Range and Coast Range mountains of extreme northwest California and western Oregon and Washington in the United States. It is a high-altitude tree, typically occurring at 300–1,500 m (980–4,920 ft) altitude, only rarely reaching the tree line."
  ],
  "abies_nordmanniana": [
    "Abies nordmanniana, the Nordmann fir or Caucasian fir, is a fir indigenous to the mountains south and east of the Black Sea, in Turkey, Georgia and the Russian Caucasus. It occurs at altitudes of 900–2,200 m on mountains with precipitation of over 1,000 mm."
  ],
  "arbutus_unedo": [
    "Arbutus unedo, the strawberry tree, is an evergreen shrub or small tree in the flowering plant family Ericaceae, native to the Mediterranean region and western Europe north to western France and Ireland. Due to its presence in southwest and northwest Ireland, it is known as either \"Irish strawberry tree\", or cain or cane apple, or sometimes Killarney strawberry tree."
  ],
  "acer_tegmentosum": [
    "Acer tegmentosum, the Manchurian striped maple, is a species of deciduous tree in the maple genus, which is native to the southern part of the Russian Far East, northeastern China, and Korea."
  ],
  "pinus_griffithii": [
    "Pinus wallichiana is a coniferous evergreen tree native to the Himalaya, Karakoram and Hindu Kush mountains, from eastern Afghanistan east across northern Pakistan and north west India to Yunnan in southwest China. It grows in mountain valleys at altitudes of 1800–4300 m, reaching 30–50 m (98–164 ft) in height. It favours a temperate climate with dry winters and wet summers. In Pashto, it is known as Nishtar."
  ],
  "magnolia_dawsoniana": [
    "Magnolia dawsoniana, known as Dawson's magnolia, is a magnolia species native to the provinces of Sichuan and Yunnan in China, usually at altitudes of 1400 to 2500 m."
  ],
  "magnolia_sargentiana": [
    "Magnolia sargentiana is a species of flowering plant in the family Magnoliaceae. It is endemic to China, where it occurs in Sichuan and Yunnan. It is widely distributed but its populations are fragmented."
  ],
  "michelia_platypetala": [null],
  "castanea_crenata": [
    "Castanea crenata, known as Korean chestnut, Korean castanea, and Japanese chestnut, is a species of chestnut native to Japan and Korea. Castanea crenata exhibits resistance to Phytophthora cinnamomi, the fungal pathogen that causes ink disease in several Castanea species. The mechanism of resistance of Castanea crenata to Phytophthora cinnamomi may derive from its expression of the Cast_Gnk2-like gene."
  ],
  "sorbus_x_hybrida": [
    "Sorbus × hybrida, the oakleaf mountain ash, Swedish service-tree or Finnish whitebeam, is a hybrid species of whitebeam native to Norway, eastern Sweden, southwestern Finland, and locally in Latvia."
  ],
  "acer_spicatum": [
    "Acer spicatum, also known as dwarf maple, moose maple, and white maple, is a species of maple native to northeastern North America from Saskatchewan to Newfoundland, and south to Pennsylvania. It also grows at high elevations in the southern Appalachian Mountains to northern Georgia."
  ],
  "juniperus_chinensis": [
    "Juniperus chinensis, the Chinese juniper is a species of plant in the cypress family Cupressaceae, native to China, Myanmar, Japan, Korea and the Russian Far East. Growing 1–20 m (3.3–65.6 ft) tall, it is a very variable coniferous evergreen tree or shrub,"
  ],
  "alnus_glutinosa": [
    "Alnus glutinosa, the common alder, black alder, European alder, European black alder, or just alder, is a species of tree in the family Betulaceae, native to most of Europe, southwest Asia and northern Africa. It thrives in wet locations where its association with the bacterium Frankia alni enables it to grow in poor quality soils. It is a medium-sized, short-lived tree growing to a height of up to 30 metres (100 ft). It has short-stalked rounded leaves and separate male and female flowers in the form of catkins. The small, rounded fruits are cone-like and the seeds are dispersed by wind and water."
  ],
  "cornus_capitata": [
    "Cornus capitata is a species of dogwood known by the common names Bentham's cornel, evergreen dogwood, Himalayan flowering dogwood, and Himalayan strawberry-tree. It is native to the low-elevation woodlands of the Himalayas in China, India, and surrounding nations and it is naturalized in parts of Australia and New Zealand. It is grown elsewhere as an ornamental. This is an evergreen tree growing to 12 meters in height and width. The leaves are gray-green and pale and fuzzy underneath, and several centimeters long. It flowers during the summer in white blooms. The infructescence is a small aggregate of several individual fruits fused into a red body 2 or 3 centimeters across. It is edible but sometimes bitter. There are several varieties and hybrids."
  ],
  "alnus_incana": [
    "Alnus incana, the grey alder or speckled alder, is a species of tree in the birch family, with a wide range across the cooler parts of the Northern Hemisphere."
  ],
  "magnolia_zenii": [
    "Magnolia zenii is a species of plant in the family Magnoliaceae. It is endemic to China."
  ],
  "corylus_columa": [null],
  "kalopanax_septemlobus": [
    "Kalopanax septemlobus, common names castor aralia, tree aralia, and prickly castor oil tree, is a deciduous tree in the family Araliaceae, the sole species in the genus Kalopanax. It is native to northeastern Asia, from Sakhalin and Japan west to southwestern China. It is called cìqiū (刺楸) in Chinese, eumnamu (음나무) in Korean, and harigiri in Japanese."
  ],
  "picea_orientalis": [
    "Picea orientalis, commonly known as the Oriental spruce or Caucasian spruce, is a species of spruce native to the Caucasus and adjacent northeast Turkey."
  ],
  "prunus_armeniaca": [
    "Prunus armeniaca is the most commonly cultivated apricot species. The native range is somewhat uncertain due to its extensive prehistoric cultivation. Genetic studies indicate Central Asia is the center of origin. It is extensively cultivated in many countries and has escaped into the wild in many places."
  ],
  "magnolia_sprengeri": [
    "Magnolia sprengeri, or Sprenger's magnolia, is a species of Magnolia native to China, occurring in Gansu, Henan, Hubei, Hunan, Shaanxi, and Sichuan in forests or thickets at 1300–2400 m altitude. Named for Carl Ludwig Sprenger, a botanist of note."
  ]
}
